{"id": "META-2023-12-31-item_1-chunk_0", "metadata": {"metatags": ["Company Overview", "Metaverse Vision"], "text": "Overview\nOur mission is to give people the power to build community and bring the world closer together. All of our products, including our apps, share the vision of helping to bring the metaverse to life. We build technology that helps people connect and share, find communities, and grow businesses. Our products enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality (VR) and mixed reality (MR) headsets, and wearables. We also help people discover and learn about what is going on in the world around them, enable people to share their experiences, ideas, photos and videos, and other activities with audiences ranging from their closest family members and friends to the public at large, and stay connected everywhere by accessing our products. Meta is moving our offerings beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the metaverse, which we believe is the next evolution in social technology. Our vision for the metaverse does not center on any single product, but rather an entire ecosystem of experiences, devices, and new technologies. While the metaverse is in the very early stages of its development, we believe it will become the next computing platform and the future of social interaction. Across our work, we are innovating in artificial intelligence (AI) technologies to build new experiences that help make our platform more social, useful, and immersive. We report financial results for two segments: Family of Apps (FoA) and Reality Labs (RL). Currently, we generate substantially all of our revenue from selling advertising placements on our family of apps to marketers, which is reflected in FoA. Ads on our platform enable marketers to reach people across a range of marketing objectives, such as generating leads or driving awareness. Marketers purchase ads that can appear in multiple places including on Facebook, Instagram, Messenger, and third-party applications and websites."}}
{"id": "META-2023-12-31-item_1-chunk_1", "metadata": {"metatags": ["Investment focus", "Metaverse investment"], "text": "RL generates revenue from sales of consumer hardware products, software, and content. We invest in our business based on our company priorities. In 2024, we intend to focus on six key investment areas: AI, the metaverse, our discovery engine, monetization of our products and services, regulatory readiness, and enhancing developer efficiency to build, iterate, and optimize products quickly. Our AI investments support initiatives across our products and services, helping power the systems that rank content in our apps, our discovery engine that recommends relevant content, the tools advertisers use to reach customers, the development of new generative AI experiences, and the tools that make our product development more efficient and productive. The majority of our investments are directed toward developing our family of apps. In 2023, 80% of our total costs and expenses were recognized in FoA and 20% were recognized in RL. Our FoA investments were $70.13 billion in 2023 and include expenses relating to headcount, data centers and technical infrastructure as part of our efforts to develop our apps and our advertising services. We are also making significant investments in our metaverse efforts, including developing virtual and augmented reality devices, software for social platforms, neural interfaces, and other foundational technologies. Our total RL investments were $18.02 billion in 2023 and include expenses relating to headcount and technology development across these efforts. These are fundamentally new technologies that we expect will evolve as the metaverse ecosystem develops, and many products for the metaverse may only be fully realized in the next decade. Although it is inherently difficult to predict when and how the metaverse ecosystem will develop, we expect our RL segment to continue to operate at a loss for the foreseeable future, and our ability to support our metaverse efforts is dependent on generating sufficient profits from other areas of our business."}}
{"id": "META-2023-12-31-item_1-chunk_2", "metadata": {"metatags": ["App Descriptions", "Future Monetization"], "text": "We expect this will be a complex, evolving, and long-term initiative. We are investing now because we believe this is the next chapter of the internet and will unlock monetization opportunities for businesses, developers, and creators, including around advertising, hardware, and digital goods. Family of Apps Products\nFacebook. Facebook helps give people the power to build community and bring the world closer together. It's a place for people to share life's moments and discuss what's happening, nurture and build relationships, discover and connect to interests, and create economic opportunity. They can do this through Feed, Reels, Stories, Groups, Marketplace, and more.\nInstagram. Instagram brings people closer to the people and things they love. Instagram Feed, Stories, Reels, Live, and messaging are places where people and creators can connect and express themselves through photos, video, and private messaging, and discover and shop from their favorite businesses.\nMessenger. Messenger is a simple yet powerful messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls.\nThreads. Threads is an application for text-based updates and public conversations, where communities come together to discuss topics of interest. People can connect directly with their favorite creators and others who love the same things or build a loyal following of their own to share their ideas, opinions, and creativity with the world.\nWhatsApp. WhatsApp is a simple, reliable, and secure messaging application that is used by people and businesses around the world to communicate and transact in a private way. Within WhatsApp we launched WhatsApp Channels, a one-to-many broadcast service designed to help people follow information from people and organizations that are important to them."}}
{"id": "META-2023-12-31-item_1-chunk_3", "metadata": {"metatags": ["Metaverse investments", "Reality Labs"], "text": "Reality Labs Products\nMany of our metaverse investments are directed toward long-term, cutting-edge research and development for products that are not on the market today and may only be fully realized in the next decade. This includes exploring new technologies such as neural interfaces using electromyography, which lets people control their devices using neuromuscular signals, as well as innovations in AI and hardware to help build next-generation interfaces. In the near term, we are continuing to develop early metaverse experiences through Reality Labs products that help people feel connected, anytime, anywhere. Our current product offerings in VR include our Meta Quest devices, as well as software and content available through the Meta Quest Store, which enable a range of social experiences that allow people to defy physical distance while engaging in gaming, fitness, entertainment, and more. For example, Meta Horizon Worlds is a social platform where people can interact with friends, meet new people, play games, and attend virtual events. To drive greater adoption and acceptance of VR we have also introduced MR capabilities, which allow users to experience the immersion and presence of VR while still being grounded in the physical world, through our Meta Quest Pro and Meta Quest 3 devices. We have continued to advance our augmented reality (AR) roadmap to include offerings such as the Ray-Ban Meta smart glasses, which feature Meta AI, our advanced conversational assistant, as well as offer the ability to livestream video and let people stay more present through hands-free interaction. We also offer Meta Spark, a platform that allows creators and businesses to build AR experiences that bring the digital and physical worlds together in our apps."}}
{"id": "META-2023-12-31-item_1-chunk_4", "metadata": {"metatags": ["Metaverse investments", "Business competition"], "text": "In general, while all of these investments are part of our long-term initiative to help build the metaverse, our VR and social platform efforts also include notable shorter-term projects developing specific products and services to go to market, whereas our AR efforts are primarily directed toward longer-term research and development projects. We apply significant judgment in estimating this expense breakdown as there are certain shared costs across product lines, and our expectations are subject to change, including as the metaverse ecosystem and our business strategies evolve. In particular, we regularly evaluate our product roadmaps and make significant changes as our understanding of the technological challenges and market landscape and our product ideas and designs evolve.\nCompetition\nOur business is characterized by innovation, rapid change, and disruptive technologies. We compete with companies providing connection, sharing, discovery, and communication products and services to users online, as well as companies that sell advertising to businesses looking to reach consumers and/or develop tools and systems for managing and optimizing advertising campaigns. We face significant competition in every aspect of our business, including, but not limited to, companies that facilitate the ability of users to create, share, communicate, and discover content and information online or\nenable marketers to reach their existing or prospective audiences. We compete to attract, engage, and retain people who use our products, to attract and retain businesses that use our free or paid business and advertising services, and to attract and retain developers who build compelling applications that integrate with our products."}}
{"id": "META-2023-12-31-item_1-chunk_5", "metadata": {"metatags": ["Competition", "AI Investment"], "text": "We also compete with companies that develop and deliver consumer hardware and virtual and augmented reality products and services. We also expect to face additional competition as we introduce or acquire new products, as our existing products evolve, or as other companies introduce new products and services, including as part of efforts to develop the metaverse or innovate through the development and application of new technologies such as AI.\nOur product development philosophy centers on continuous innovation in creating and improving products that are social by design, which means that our products are designed to place people and their social interactions at the core of the product experience. As our user base grows, as engagement with products like video, VR, and MR increases, and as we deepen our investment in new technologies, our computing needs continue to expand. We have designed and built our own data centers and key portions of our technical infrastructure, and a substantial portion of our technical infrastructure is also provided by third parties. Our ability to provide and continue to innovate our products and services depends on the continued availability of components, power, and network capacity. We make significant investments in technology both to improve our existing products and services and to develop new ones, as well as for our marketers and developers. We are also investing in protecting the security, privacy, and integrity of our platform by investing in both people and technology to strengthen our systems against abuse. Across all of these efforts, we are making significant investments in AI initiatives, including generative AI, to, among other things, recommend relevant content across our products through our AI-powered discovery engine, enhance our advertising tools and improve our ad delivery, targeting, and measurement capabilities, and to develop new products as well as new features for existing products."}}
{"id": "META-2023-12-31-item_1-chunk_6", "metadata": {"metatags": ["Sales operations", "IP protection"], "text": "Sales and Operations\nThe majority of our marketers use our self-service ad platform to launch and manage their advertising campaigns. We also have a global sales force that is focused on attracting and retaining advertisers and providing support to them throughout the stages of the marketing cycle from pre-purchase decision-making to real-time optimizations to post-campaign analytics. We work directly with these advertisers, as well as through advertising agencies and resellers. We operate offices in approximately 90 cities around the globe, the majority of which have a sales presence. We also invest in and rely on self-service tools to provide direct customer support to our users and partners. For our RL products, our sales and operations efforts utilize third-party sales channels such as retailers, resellers, and our direct-to-consumer channel, Meta.com. These efforts are focused on driving consumer and enterprise sales and adoption of our Meta Quest portfolio of products and Ray-Ban Meta smart glasses.\nMarketing\nHistorically, our communities have generally grown organically with people inviting their friends to connect with them, supported by internal efforts to stimulate awareness and interest. In addition, we have invested and will continue to invest in marketing our products and services to grow our brand and help build community around the world.\nIntellectual Property\nTo establish and protect our proprietary rights, we rely on a combination of patents, trademarks, copyrights, trade secrets, including know-how, license agreements, confidentiality procedures, non-disclosure agreements with third parties, employee disclosure and invention assignment agreements, and other contractual rights. In addition, to further protect our proprietary rights, from time to time we have purchased patents and patent applications from third parties. We do not believe that our proprietary technology is dependent on any single patent or copyright or groups of related patents or copyrights."}}
{"id": "META-2023-12-31-item_1-chunk_7", "metadata": {"metatags": ["Government Regulation", "Evolving Laws"], "text": "We believe the duration of our patents is adequate relative to the expected lives of our products. Government Regulation\nWe are subject to a variety of laws and regulations in the United States and abroad that involve matters central to our business, many of which are still evolving and being tested in courts, and could be interpreted in ways that could harm our business. These laws and regulations involve matters including privacy, data use, data protection and personal information, the provision of our services to younger users, biometrics, encryption, rights of publicity, content, integrity, intellectual property, advertising, marketing, distribution, data security, data retention and deletion, data localization and storage, data disclosure, AI and machine learning, electronic contracts and other communications, competition, protection of minors, consumer protection, civil rights, accessibility, telecommunications, product liability, e-commerce, taxation, economic or other trade controls including sanctions, anti-corruption and political law compliance, securities law compliance, and online payment services. Foreign data protection, privacy, content, competition, consumer protection, and other laws and regulations can impose different obligations or be more restrictive than those in the United States, and create the potential for significant fines to be imposed. These U.S. federal and state, EU, and other international laws and regulations, which in some cases can be enforced by private parties in addition to government entities, are constantly evolving and can be subject to significant change. As a result, the application, interpretation, and enforcement of these laws and regulations are often uncertain, particularly in the new and rapidly evolving industry in which we operate, and may be interpreted and applied inconsistently from jurisdiction to jurisdiction and inconsistently with our current policies and practices."}}
{"id": "META-2023-12-31-item_1-chunk_8", "metadata": {"metatags": ["regulatory risks", "data transfer"], "text": "For example, regulatory or legislative actions or litigation concerning the manner in which we display content to our users, moderate content, provide our services to younger users, or are able to use data in various ways, including for advertising, or otherwise relating to content that is made available on our products, could adversely affect our financial results, including by imposing significant fines that increasingly may be calculated based on global revenue. In the United States, in 2023, the U.S. Supreme Court heard oral argument in a matter in which the scope of the protections available to online platforms under Section 230 of the Communications Decency Act (Section 230) was at issue, but it ultimately declined to address Section 230 in its decision. In addition, there have been, and continue to be, various efforts to remove or restrict the scope of the protections available to online platforms under Section 230, and any such changes may increase our costs or require significant changes to our products, business practices, or operations, which could adversely affect our business and financial results. We are also subject to evolving laws and regulations that dictate whether, how, and under what circumstances we can transfer, process or receive certain data that is critical to our operations, including data shared between countries or regions in which we operate and data shared among our products and services. If we are unable to transfer data between and among countries and regions in which we operate, or if we are restricted from sharing data among our products and services, it could affect our ability to provide our services, the manner in which we provide our services or our ability to target ads, which could adversely affect our financial results. For example, the Privacy Shield, a transfer framework we relied upon for data transferred from the European Union to the United States, was invalidated in July 2020 by the Court of Justice of the European Union (CJEU)."}}
{"id": "META-2023-12-31-item_1-chunk_9", "metadata": {"metatags": ["Data transfers", "Regulatory scrutiny"], "text": "In addition, the other bases upon which Meta relies to transfer such data, such as Standard Contractual Clauses (SCCs), have been subjected to regulatory and judicial scrutiny. For example, although the CJEU upheld the validity of SCCs as a basis to transfer user data from the European Union to the United States in July 2020, on May 12, 2023, the Irish Data Protection Committee (IDPC) issued a Final Decision concluding that Meta Platforms Ireland's reliance on SCCs in respect of certain transfers of European Economic Area (EEA) Facebook user data was not in compliance with the European General Data Protection Regulation (GDPR). The IDPC issued an administrative fine of EUR €1.2 billion as well as corrective orders requiring Meta Platforms Ireland to suspend the relevant transfers and to bring its processing operations into compliance with Chapter V GDPR by ceasing the unlawful processing, including storage, of such data in the United States. We are appealing this decision and the corrective orders are currently subject to an interim stay from the Irish High Court. Separately, on March 25, 2022, the European Union and United States announced that they had reached an agreement in principle on a new EU-U.S. Data Privacy Framework (EU-U.S. DPF). On October 7, 2022, President Biden signed the Executive Order on Enhancing Safeguards for United States Signals Intelligence Activities (E.O.), and on June 30, 2023, the European Union and the three additional countries making up the EEA were designated by the United States Attorney General as a \"qualifying state\" under Section 3(f) of the E.O. On July 10, 2023, the European Commission adopted an adequacy decision in relation to the United States."}}
{"id": "META-2023-12-31-item_1-chunk_10", "metadata": {"metatags": ["Data Privacy Framework", "Regulatory Compliance"], "text": "The adequacy decision concludes that the United States ensures an adequate level of protection for personal data transferred from the European Union to organizations in the United States that are included in the \"Data Privacy Framework List,\" maintained and made publicly available by the United States Department of Commerce pursuant to the EU-U.S. DPF. The implementation of the EU-U.S. DPF and the adequacy decision are important and welcome milestones, and we are implementing steps to comply with the above corrective orders following engagement with the IDPC. If we are required to take additional steps to comply with the corrective orders, this could increase the cost and complexity of delivering our products and services in Europe. Furthermore, the EU-U.S. DPF replaces\ntwo prior adequacy frameworks which were invalidated by the CJEU. A further invalidation of the EU-U.S. DPF by the CJEU could create considerable uncertainty and lead to us being unable to offer a number of our most significant products and services, including Facebook and Instagram, in Europe, which would materially and adversely affect our business, financial condition, and results of operations. We have been subject to other significant legislative and regulatory developments, which together with proposed or new legislation and regulations could significantly affect our business in the future. For example, we have implemented a number of product changes and controls as a result of requirements under the GDPR, and may implement additional changes in the future. The GDPR also requires submission of personal data breach notifications to our lead European Union privacy regulator, the IDPC, and includes significant penalties for non-compliance with the notification obligation as well as other requirements of the regulation."}}
{"id": "META-2023-12-31-item_1-chunk_11", "metadata": {"metatags": ["GDPR uncertainty", "Data privacy regulations"], "text": "The interpretation of the GDPR is still evolving, including through decisions of the CJEU, and draft decisions in investigations by the IDPC are subject to review by other European privacy regulators as part of the GDPR's consistency mechanism, which may lead to significant changes in the final outcome of such investigations. As a result, the interpretation and enforcement of the GDPR, as well as the imposition and amount of penalties for non-compliance, are subject to significant uncertainty, and as it evolves, could potentially have a negative impact on our business and/or our operations. In addition, Brazil, the United Kingdom, and other countries have enacted similar data protection regulations imposing data privacy-related requirements on products and services offered to users in their respective jurisdictions. The California Consumer Privacy Act, as amended by the California Privacy Rights Act, and similar laws recently enacted by other states also establish certain transparency rules and create certain data privacy rights for users. Some states have also proposed or enacted laws specifically focused on the privacy rights and controls for users under 18 years old and their parents or guardians. Like comprehensive privacy laws, these laws are evolving and subject to interpretation, and may restrict our ability to offer certain products and services provided to all or certain cohorts of users in those states, adversely affecting our advertising business. In addition, the European Union's ePrivacy Directive and national implementation laws impose additional limitations on the use of data across messaging products and include significant penalties for non-compliance. Changes to our products or business practices as a result of these or similar developments have adversely affected, and may in the future adversely affect, our advertising business."}}
{"id": "META-2023-12-31-item_1-chunk_12", "metadata": {"metatags": ["Regulatory changes", "Compliance costs"], "text": "For example, in response to regulatory developments in Europe, we announced plans to change the legal basis for behavioral advertising on Facebook and Instagram in the EU, EEA, and Switzerland from \"legitimate interests\" to \"consent,\" and in November 2023 we began offering users in the region a \"subscription for no ads\" alternative. We are continuing to engage with regulators on our new consent model, including regarding compliance with requirements under the GDPR, Digital Markets Act (DMA), and EU consumer laws. These or any similar developments in the future may negatively impact our user growth and engagement, revenue, and financial results. Similarly, there are a number of legislative proposals or recently enacted laws in the European Union, the United States, at both the federal and state level, as well as other jurisdictions that could impose new obligations or limitations in areas affecting our business. For example, the DMA in the European Union imposes new restrictions and requirements on companies like ours, including in areas such as the combination of data across services, mergers and acquisitions, and product design. The DMA also includes significant penalties for non-compliance, and its key requirements will be enforceable against designated gatekeeper companies beginning in March 2024. The DMA has caused, and may in the future cause, us to incur significant compliance costs and make changes to our products or business practices. The requirements under the DMA will likely be subject to further interpretation and regulatory engagement. Pending or future proposals to modify competition laws in the United States and other jurisdictions could have similar effects. We are also subject to content-related legislation such as the Digital Services Act (DSA) in the European Union, which started to apply to our business as of August 2023, imposes certain restrictions and requirements for our products and services, and subjects us to increased compliance costs."}}
{"id": "META-2023-12-31-item_1-chunk_13", "metadata": {"metatags": ["data regulation", "legal compliance"], "text": "The DSA also includes significant penalties for non-compliance. In addition, some countries, such as India and Turkey, are considering or have passed legislation implementing data protection requirements, new competition requirements, or requiring local storage and processing of data or similar requirements that could require substantial changes to our products, increase the cost and complexity of delivering our services, cause us to cease the offering of our products and services in certain countries, and/or result in fines or other penalties. New legislation or regulatory decisions that restrict our ability to collect and use information about minors may also result in limitations on our advertising services or our ability to offer products and services to minors in certain jurisdictions. We are, and expect to continue to be, the subject of investigations, inquiries, data requests, requests for information, actions, and audits by government authorities and regulators in the United States, Europe, and around the world, particularly in the areas of privacy, data use and data protection, including with respect to processing of sensitive data, data from third parties, data for advertising purposes, data security, minors, safety, law enforcement, consumer protection, civil rights, content moderation, use of our platform for illegal, illicit, or otherwise objectionable activity, competition, AI, and machine learning. We are also currently, and may in the future be, subject to regulatory orders or consent decrees, including the modified consent order we entered into with the U.S. Federal Trade Commission (FTC), which took effect in April 2020 and,\namong other things, required us to significantly enhance our practices and processes for privacy compliance and oversight."}}
{"id": "META-2023-12-31-item_1-chunk_14", "metadata": {"metatags": ["FTC compliance", "Human capital"], "text": "The FTC also continues to monitor us and our compliance with the modified consent order and initiated an administrative proceeding against us, which we are challenging, that alleges deficient compliance and violations of the Children's Online Privacy Protection Act (COPPA), the COPPA Rule, and Section 5 of the Federal Trade Commission Act and seeks changes to our business. If we are unsuccessful in our challenge to the FTC's action and the agency imposes its proposed order in its current form, we would be subject to significant limitations, including on our ability to launch new and modified products or use data of users under 18 years old. Orders issued by, or inquiries or enforcement actions initiated by, government or regulatory authorities could cause us to incur substantial costs, expose us to civil and criminal liability (including liability for our personnel) or penalties (including substantial monetary remedies), interrupt or require us to change our business practices in a manner materially adverse to our business (including changes to our products or user data practices), result in negative publicity and reputational harm, divert resources and the time and attention of management from our business, or subject us to other structural or behavioral remedies that adversely affect our business. For additional information about government regulation applicable to our business, see Part I, Item 1A, \"Risk Factors\" in this Annual Report on Form 10-K.\nHuman Capital\nAt Meta, everything we do is about helping people feel connected and closer, and we are proud of our unique company culture. We had a global workforce of 67,317 employees as of December 31, 2023, and we have offices in approximately 90 cities around the world. We are committed to fostering an enriching environment for our workforce and we are focused on supporting our people in doing the best work of their careers."}}
{"id": "META-2023-12-31-item_1-chunk_15", "metadata": {"metatags": ["Cost reduction", "Employee support"], "text": "We offer competitive compensation and a wide range of benefits, including many learning and development resources, and we work to build a diverse and inclusive workplace. Beginning in November 2022, we took a number of steps to reduce our expense base. For example, our cost reduction efforts have included scaling back budgets, reducing company perks, shrinking our real estate footprint, and employee layoffs and restructurings. We make it a priority to treat outgoing employees with respect and provide a generous severance package. For U.S. employees, that includes severance of 16 weeks of base pay plus two additional weeks for every year of service, payment for all remaining paid time off, restricted stock unit vesting through their last day on payroll, health insurance, coverage of the cost of healthcare for employees and their families for six months, career services that included three months of career support with an external vendor and early access to unpublished job leads, immigration support that included dedicated immigration specialists to help guide employees based on their needs. We offer similar support for outgoing employees outside of the United States while taking into account local employment laws.\n\nWe value our investment in growing and keeping a highly skilled workforce. We aim to provide all of our employees with regular performance reviews twice a year as we believe it is an important part of how we support their growth and career development while also recognizing and rewarding their impact at Meta. We also offer career development opportunities and work experience programs that extend beyond the physical and virtual classroom. To do this, we utilize various learning modalities, such as live virtual and in-person learning experiences, on-demand e-learning, self-service resources, learning communities, and coaching engagements."}}
{"id": "META-2023-12-31-item_1-chunk_16", "metadata": {"metatags": ["Employee surveys", "Employee benefits"], "text": "The Pulse of Our Workforce\nEach year, we conduct company-wide employee surveys to help us understand how employees feel about working at Meta and what we can do to improve their experience. Our surveys help us measure company, manager, team, and personal experience over time. Further, our more frequent surveys, such as those that have been administered daily to an ongoing random sample of employees, allow us to measure real-time sentiment around emerging events and company changes. These surveys are designed to invite feedback and actionable suggestions, inform decisions, and drive change across the company. In 2024, we expect to update our listening strategy and product capabilities, based on feedback from key groups, to further improve actionability and impact.\n\nCompensation, Benefits, Health, and Well-being\nWe offer competitive compensation to attract and retain the best people, and we help care for our people so they can focus on our mission. Our employees' total compensation package includes market-competitive salary, bonuses or sales incentives, and equity. We generally offer full-time employees equity at the time of hire and through annual equity grants because we want them to be owners of the company and committed to our long-term success. We have conducted pay equity analyses for many years, and continue to be committed to pay equity. For example, in July 2023, we announced that our analyses confirm that we continue to have pay equity across genders globally and by race in the United States for people in similar jobs, accounting for factors such as location, role, and level. Through Life@ Meta, our holistic approach to benefits, we continue to provide our employees and their dependents with resources to help them thrive."}}
{"id": "META-2023-12-31-item_1-chunk_17", "metadata": {"metatags": ["Employee Benefits", "Workforce Diversity"], "text": "We offer a wide range of benefits across areas such as health, family, finance, community, and time away, including family building benefits, family care resources, retirement savings plans, access to legal services, Meta Resource Groups to build community at Meta, and health and well-being benefits. Our health and well-being programs are designed to give employees a choice of flexible benefits to help them reach their personal well-being goals. Our programs are tailored to help boost employee physical and mental health, create financial peace of mind, provide support for families, and help employees build a strong community. Programs are designed and funded to support needs like autism care, cancer care, transgender services, holistic well-being, including mental health programs and retirement savings, which represent a few of the ways we support our employees and their dependents.\n\nDiverse and Inclusive Workplace\nWe work to build a diverse and inclusive workplace where we can leverage our collective cognitive diversity to build the best products and make the best decisions for the global community we serve. In our 2023 Responsible Business Practices Report, we published our global diversity and U.S. ethnic diversity workforce data. As of December 31, 2022, our global employee base was composed of 45.4% underrepresented people, with 47.9% underrepresented people in the U.S., and 43.1% of our leaders in the U.S. being people of color. As published in our 2023 Responsible Business Practices Report, people with disabilities now represent 7.2% of our U.S. workforce, and based on voluntary self-identification, veterans represented 2.3% and members of the LGBTQ+ community make up 9.8% of our U.S. workforce. We want our products to work for people around the world and we need to grow and keep the best talent in order to do that. We also remain committed to having a skilled, inclusive and diverse workforce because we believe cognitive diversity fuels innovation."}}
{"id": "META-2023-12-31-item_1-chunk_18", "metadata": {"metatags": ["DEI initiatives", "employee development"], "text": "To aid in this effort, we have taken steps to reduce bias from our hiring processes and performance management systems, as well as offering learning and development courses for our employees."}}
{"id": "META-2023-12-31-item_10-chunk_0", "metadata": {"metatags": ["Code of Conduct", "corporate governance"], "text": "Our board of directors has adopted a Code of Conduct applicable to all officers, directors, and employees, which is available on our website (investor.fb.com) under \"Leadership & Governance.\" We intend to satisfy the disclosure requirement under Item 5.05 of Form 8-K regarding amendment to, or waiver from, a provision of our Code of Conduct by posting such information on the website address and location specified above."}}
{"id": "META-2023-12-31-item_11-chunk_0", "metadata": {"metatags": ["Proxy Statement", "SEC Filing"], "text": "The information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended December 31, 2023."}}
{"id": "META-2023-12-31-item_12-chunk_0", "metadata": {"metatags": ["Proxy statement", "SEC filing"], "text": "The information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended December 31, 2023."}}
{"id": "META-2023-12-31-item_13-chunk_0", "metadata": {"metatags": ["Proxy Statement", "Incorporated by Reference"], "text": "The information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended December 31, 2023."}}
{"id": "META-2023-12-31-item_14-chunk_0", "metadata": {"metatags": ["Proxy statement", "Incorporation by reference"], "text": "The information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended December 31, 2023."}}
{"id": "META-2023-12-31-item_15-chunk_0", "metadata": {"metatags": ["equity incentive", "indemnification agreement"], "text": "```\nDescription of Registrant's Capital Stock.\nForm of Indemnification Agreement.\n2012 Equity Incentive Plan, as amended.\nThird Amendment to the 2012 Equity Incentive Plan.\n```"}}
{"id": "META-2023-12-31-item_15-chunk_1", "metadata": {"metatags": ["Equity incentive plan", "Offer letters"], "text": "10.2(B)+ 2012 Equity Incentive Plan forms of award agreements.\n10.2(C)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(D)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(E)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(F)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(G)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(H)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(I)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(J)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(K)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.2(L)+ 2012 Equity Incentive Plan forms of award agreements (Additional Forms).\n10.3+ Amended and Restated Bonus Plan, effective January 1, 2023.\n10.4+ Amended and Restated Offer Letter, dated January 27, 2012, between Registrant and Mark Zuckerberg.\n10.5+ Offer Letter, dated June 5, 2020, between Registrant and Christopher K. Cox.\n10.6+ Offer Letter, dated December 22, 2022, between Registrant and Javier Olivan.\n10.7+ Offer Letter, dated March 14, 2022, between Registrant and Andrew Bosworth.\n10.8+ Offer Letter, dated November 1, 2022, between Registrant and Susan Li."}}
{"id": "META-2023-12-31-item_15-chunk_2", "metadata": {"metatags": ["Executive compensation", "Subsidiary operations"], "text": "Form of Executive Officer Offer Letter.\n\nDirector Compensation Policy, as amended.\n\nDeferred Compensation Plan for Non-Employee Directors.\n\nIndemnification Agreement Relating to Subsidiary Operations, dated March 14, 2021, between Registrant and Mark Zuckerberg.\n\nList of Subsidiaries.\n\nCompensation Recoupment Policy."}}
{"id": "META-2023-12-31-item_1C-chunk_0", "metadata": {"metatags": ["Cybersecurity risk", "Risk management"], "text": "At Meta, cybersecurity risk management is an important part of our overall risk management efforts. Our industry is prone to cybersecurity threats and attacks, and we regularly experience cybersecurity incidents of varying degrees. We believe we are a particularly attractive target as a result of our prominence and scale, the types and volume of personal data and content on our systems, and the evolving nature of our products and services. Our products and services reach billions of users and involve the collection, storage, processing, and transmission of a large amount of data. In addition, our business and operations span numerous geographies around the world, involve thousands of employees, contractors, vendors, developers, partners, and other third parties, and rely on software and hardware that is highly technical and complex. We maintain an information security program that is comprised of policies and controls designed to mitigate cybersecurity risk. However, at any given time, we face known and unknown cybersecurity risks and threats that are not fully mitigated, and we discover vulnerabilities in our program. We continuously work to enhance our information security program and risk management efforts. We use a risk management framework based on applicable laws and regulations, and informed by industry standards and industry-recognized practices, for managing cybersecurity risks within our products and services, infrastructure, and corporate resources. To identify and assess risks from cybersecurity threats, we evaluate a variety of developments including threat intelligence, first- and third-party vulnerabilities, evolving regulatory requirements, and observed cybersecurity incidents, among others. We regularly conduct risk assessments to evaluate the maturity and effectiveness of our systems and processes in addressing cybersecurity threats and to identify any areas for remediation and opportunities for enhancements."}}
{"id": "META-2023-12-31-item_1C-chunk_1", "metadata": {"metatags": ["Cybersecurity Risk", "Privacy Program"], "text": "We also engage third-party security experts and consultants to assist with assessment and enhancement of our cybersecurity risk management processes, as well as benchmarking against industry practices. In addition, we maintain a privacy risk management program to assess privacy risks related to how we are collecting, using, sharing, and storing user data, which is subject to assessment by an independent, third-party privacy assessor. Our internal audit function provides independent assessment and assurance on the overall operations of our cybersecurity and privacy programs and the supporting control frameworks. These processes support informed risk-based decision-making and prioritization of cybersecurity countermeasures and risk mitigation strategies. Our risk mitigation strategies include a broad variety of technical and operational measures, as well as annual cybersecurity and privacy training for all of our employees. In addition, we maintain specific policies and practices governing our third-party security risks, including our third-party assessment (TPA) process. Under our TPA process, we gather information from certain third parties who contract with Meta and share or receive data, or have access to or integrate with our systems, in order to help us assess potential risks associated with their security controls. We also generally require third parties to, among other things, maintain security controls to protect our confidential information and data, and notify us of material data breaches that may impact our data. Our board of directors has oversight of our strategic and business risk management and has delegated cybersecurity risk management oversight to the audit & risk oversight committee of our board of directors (Audit & Risk Oversight Committee)."}}
{"id": "META-2023-12-31-item_1C-chunk_2", "metadata": {"metatags": ["Cybersecurity risks", "Oversight committees"], "text": "Our Audit & Risk Oversight Committee is responsible for ensuring that management has processes in place designed to identify and evaluate cybersecurity risks to which the company is exposed and to implement processes and programs to manage cybersecurity risks and mitigate cybersecurity incidents. The privacy committee of our board of directors (Privacy Committee) oversees risks related to privacy and data use, including overseeing compliance with our comprehensive privacy program. Management is responsible for identifying, assessing, and managing material cybersecurity risks on an ongoing basis, establishing processes to ensure that such potential cybersecurity risk exposures are monitored, putting in place appropriate mitigation measures, maintaining cybersecurity policies and procedures, and providing regular reports to our board of directors, including through the Audit & Risk Oversight Committee and Privacy Committee. Our Chief Information Security Officer (CISO) Guy Rosen leads our cybersecurity program and oversees teams across the company supporting our security functions of identify, prevent, detect, respond, and recover. These teams are comprised of personnel with a broad range of experience across the private and public sectors, the technology industry, and different geographic regions. Mr. Rosen has two decades of experience in various cybersecurity, software development, product management, and other technology-related roles. Mr. Rosen has served in a number of significant leadership roles at our company since 2013, including oversight of security, safety, and integrity initiatives, and was appointed as our CISO in 2022. Prior to joining our company, Mr. Rosen served in senior leadership, engineering, and operational roles across technology organizations. Our cybersecurity teams monitor the prevention, detection, mitigation, and remediation of cybersecurity incidents through a variety of technical and operational measures, and regularly report to our CISO."}}
{"id": "META-2023-12-31-item_1C-chunk_3", "metadata": {"metatags": ["cybersecurity program", "cybersecurity risks"], "text": "Our CISO is part of the senior management team at the company and regularly updates the Audit & Risk Oversight Committee on the company’s cybersecurity program, including cybersecurity risks, incidents, and mitigation strategies. In 2023, we did not identify any cybersecurity threats that have materially affected or are reasonably likely to materially affect our business strategy, results of operations, or financial condition. However, despite our efforts, we cannot eliminate all risks from cybersecurity threats, or provide assurances that we have not experienced undetected cybersecurity incidents."}}
{"id": "META-2023-12-31-item_2-chunk_0", "metadata": {"metatags": ["Real Estate", "Global Presence"], "text": "Our corporate headquarters are located in Menlo Park, California. As of December 31, 2023, we owned and leased approximately 10 million square feet of office and building space for our corporate headquarters and in the surrounding areas, which included approximately three million square feet of unoccupied office and building space that we plan to either sublease, early terminate, or abandon related to our facilities consolidation restructuring efforts. We also owned and leased approximately 62 acres of land to be developed to accommodate anticipated future growth.\nIn addition, we have offices in approximately 90 cities across North America, Europe, the Middle East, Africa, Asia Pacific, and Latin America. We also own 21 data center locations globally.\nWe believe that our facilities are adequate for our current needs."}}
{"id": "META-2023-12-31-item_3-chunk_0", "metadata": {"metatags": ["Legal proceedings", "Regulatory risks"], "text": "As a multinational company with a complex and evolving business, we are, and expect to continue to be, subject to numerous claims, litigation, regulatory, tax, and government inquiries and investigations, and other legal proceedings in jurisdictions around the world. Although we believe many of these matters are without merit and are vigorously defending them, we may not be successful. Any litigation to which we are a party may be resolved adversely or we may be subject to an unfavorable judgment that may not be reversed upon appeal. We may also decide to settle litigation, disputes, or other legal proceedings in some instances on terms that are unfavorable to us. In addition, we may become subject to orders or consent decrees imposed by government or regulatory authorities. Any such developments could cause us to incur substantial costs, expose us to civil and criminal liability (including liability for our personnel) or penalties (including substantial monetary remedies), interrupt or require us to change our business practices in a manner materially adverse to our business (including changes to our products and services or user data practices), result in negative publicity and reputational harm, divert resources and the time and attention of management from our business, or subject us to other structural or behavioral remedies that adversely affect our business. We have experienced such outcomes to varying degrees in the past, and we expect to continue to face a challenging litigation and regulatory environment, including in light of complex and evolving laws and regulations, as well as the scale of our business and the size of our user and advertiser base. Over the last several years, the number and potential significance of the litigation and investigations involving the company have increased, and there can be no assurance that this trend will not continue."}}
{"id": "META-2023-12-31-item_3-chunk_1", "metadata": {"metatags": ["Legal challenges", "Regulatory regimes"], "text": "For example, we are facing numerous cases in the United States in which plaintiffs are attempting to avoid or limit the application of Section 230 of the Communications Decency Act to their claims. Outside of the United States, we are subject to new regulatory regimes, including the Digital Services Act, Digital Markets Act, and similar statutes in non-EU countries, and new fining guidelines under existing regulatory regimes like the General Data Protection Regulation (GDPR). We are also responding to litigation and government investigations related to our alleged role in causing or contributing to various societal harms, including mental and physical health and safety impacts on users, particularly younger users, child and adult sexual exploitation, illegal activity with respect to drugs, fraud, unlawful discrimination, and other harms potentially impacting large numbers of people. This is in addition to significant tax, antitrust, stockholder, and privacy litigation and investigations. Furthermore, as the number of our users and amount of our revenue have grown, our potential exposure to substantial damages awards and fines has increased. In some instances, particularly with novel legal and factual claims, new regulatory regimes or statutes that have not previously been enforced, or where the nature or type of enforcement pursued against us is novel, it can be very difficult to assess the likelihood or extent of potential liabilities, including the applicability and amount of any fines or penalties. While we have identified below certain matters that we believe to be material, there can be no assurance that additional material losses or limitations on our activities will not result from claims that have not yet been asserted or are not yet determined to be material."}}
{"id": "META-2023-12-31-item_3-chunk_2", "metadata": {"metatags": ["privacy litigation", "data misuse"], "text": "Privacy and Related Matters\nBeginning on March 20, 2018, multiple putative class actions were filed in state and federal courts in the United States and elsewhere against us and certain of our directors and officers alleging various causes of action in connection with our platform and user data practices as well as the misuse of certain data by a developer that shared such data with third parties in violation of our terms and policies, and seeking unspecified damages and injunctive relief. With respect to the putative class actions alleging fraud and violations of consumer protection, privacy, and other laws in connection with the same matters, several of the cases brought on behalf of consumers in the United States were consolidated in the U.S. District Court for the Northern District of California (In re Facebook, Inc., Consumer Privacy User Profile Litigation). On September 9, 2019, the court granted, in part, and denied, in part, our motion to dismiss the consolidated putative consumer class action. On December 22, 2022, the parties entered into a settlement agreement to resolve the lawsuit, which provides for a payment of $725 million by us. The settlement was approved by the court on October 10, 2023, and the payment was made in November 2023. In addition, our platform and user data practices, as well as the events surrounding the misuse of certain data by a developer, became the subject of U.S. Federal Trade Commission (FTC), state attorneys general, and other government inquiries in the United States, Europe, and other jurisdictions. We entered into a settlement and modified consent order to resolve the FTC inquiry, which took effect in April 2020 and required us to pay a penalty of $5.0 billion and to significantly enhance our practices and processes for privacy compliance and oversight."}}
{"id": "META-2023-12-31-item_3-chunk_3", "metadata": {"metatags": ["Legal proceedings", "FTC inquiry"], "text": "The state attorneys general inquiry and certain government inquiries in other jurisdictions remain ongoing and could subject us to additional substantial fines and costs, require us to change our business practices, divert resources and the attention of management from our business, or adversely affect our business. On July 16, 2021, a stockholder derivative action was filed in Delaware Court of Chancery against certain of our directors and officers asserting breach of fiduciary duty and related claims relating to our historical platform and user data practices, as well as our settlement with the FTC. On July 20, 2021, other stockholders filed an amended derivative complaint in a related Delaware Chancery Court action, asserting breach of fiduciary duty and related claims against certain of our current and former directors and officers in connection with our historical platform and user data practices. On November 4, 2021, the lead plaintiffs filed a second amended and consolidated complaint in the stockholder derivative action. The pending consolidated matter is In re Facebook Inc. Derivative Litigation. On January 19, 2022, we filed a motion to dismiss, which was denied in part on May 10, 2023. The insider trading claim was dismissed as to all defendants except Mark Zuckerberg, and the motion was denied as to the breach of fiduciary duty claims. On May 3, 2023, the FTC filed a public administrative proceeding (In the Matter of Facebook, Inc.), seeking substantial changes to the modified consent order, which took effect in April 2020 after its entry by the U.S. District Court for the District of Columbia. The changes sought by the FTC are set forth in a proposed order and include, among others, a prohibition on our use of minors' data for any commercial purposes, changes to the composition of our board of directors, and significant limitations on our ability to modify and launch new products. On May 31, 2023, we filed a motion before the U.S. District Court for the District of Columbia (USA v."}}
{"id": "META-2023-12-31-item_3-chunk_4", "metadata": {"metatags": ["FTC legal challenges", "regulatory compliance"], "text": "Facebook, Inc.) seeking to enjoin the FTC from further pursuing its agency process to modify the modified consent order. On November 27, 2023, the district court denied our motion, and we have appealed to the U.S. Court of Appeals for the District of Columbia Circuit (U.S. v. Facebook, Inc.) and sought to stay the FTC proceeding pending resolution of the appeal. On January 12, 2024, the district court denied our motion for a stay pending appeal and, on January 25, 2024, we filed a motion for a stay pending appeal before the Court of Appeals. On November 29, 2023, we separately filed a complaint, also in the U.S. District Court for the District of Columbia (Meta Platforms, Inc. v. FTC), asserting constitutional challenges to the structure of the FTC, and seeking to preliminarily enjoin the FTC proceeding during the pendency of the litigation. On December 13, 2023, the FTC filed an opposition to our motion for preliminary injunction and a motion to dismiss the complaint. Oral argument on our motion to enjoin and the FTC's motion to dismiss is scheduled for March 1, 2024. If the FTC proceeding is not enjoined or stayed, our response in the proceeding will be due on March 15, 2024, after which time the FTC could amend the order to impose these additional requirements set forth in the proposed order. We should have the opportunity to appeal an FTC decision modifying the order and could request the\nappellate court to stay the enforcement of the modifications to the order while the appeal is pending. It is unclear whether the appeal or the request for a stay would be successful. We also notify the Irish Data Protection Commission (IDPC), our lead European Union privacy regulator under the GDPR, of certain other personal data breaches and privacy issues, and are subject to inquiries and investigations by the IDPC and other European regulators regarding various aspects of our regulatory compliance."}}
{"id": "META-2023-12-31-item_3-chunk_5", "metadata": {"metatags": ["GDPR compliance", "EU-U.S. DPF"], "text": "For example, on May 12, 2023, the IDPC issued a Final Decision concluding that Meta Platforms Ireland's reliance on Standard Contractual Clauses in respect of certain transfers of European Economic Area (EEA) Facebook user data was not in compliance with the GDPR. The IDPC issued an administrative fine of EUR €1.2 billion as well as corrective orders requiring Meta Platforms Ireland to suspend the relevant transfers and to bring its processing operations into compliance with Chapter V GDPR by ceasing the unlawful processing, including storage, of such data in the United States. We are appealing this decision and the corrective orders are currently subject to an interim stay from the Irish High Court. On October 7, 2022, President Biden signed the Executive Order on Enhancing Safeguards for United States Signals Intelligence Activities (E.O.), and on June 30, 2023, the European Union and the three additional countries making up the EEA were designated by the United States Attorney General as a \"qualifying state\" under Section 3(f) of the E.O. On July 10, 2023, the European Commission adopted an adequacy decision in relation to the United States. The adequacy decision concludes that the United States ensures an adequate level of protection for personal data transferred from the European Union to organizations in the United States that are included in the \"Data Privacy Framework List,\" maintained and made publicly available by the United States Department of Commerce pursuant to the EU-U.S. Data Privacy Framework (EU-U.S. DPF). The implementation of the EU-U.S. DPF and the adequacy decision are important and welcome milestones, and we are implementing steps to comply with the above corrective orders following engagement with the IDPC."}}
{"id": "META-2023-12-31-item_3-chunk_6", "metadata": {"metatags": ["Legal Risks", "Government Investigations"], "text": "We are subject to various litigation and government inquiries and investigations, formal or informal, by competition authorities in the United States, Europe, and other jurisdictions. Such investigations, inquiries, and lawsuits concern, among other things, our business practices in the areas of social networking or social media services, digital advertising, and/or mobile or online applications, as well as our acquisitions."}}
{"id": "META-2023-12-31-item_3-chunk_7", "metadata": {"metatags": ["Antitrust investigations", "FTC complaint"], "text": "For example, in 2019 we became the subject of antitrust investigations by the FTC and U.S. Department of Justice. On December 9, 2020, the FTC filed a complaint (FTC v. Meta Platforms, Inc.) against us in the U.S. District Court for the District of Columbia alleging that we engaged in anticompetitive conduct and unfair methods of competition in violation of Section 5 of the Federal Trade Commission Act and Section 2 of the Sherman Act, including by acquiring Instagram in 2012 and WhatsApp in 2014 and by maintaining conditions on access to our platform. The FTC sought a permanent injunction against our company's alleged violations of the antitrust laws, and other equitable relief, including divestiture or reconstruction of Instagram and WhatsApp. On June 28, 2021, the court granted our motion to dismiss the complaint filed by the FTC with leave to amend. On August 19, 2021, the FTC filed an amended complaint, and on October 4, 2021, we filed a motion to dismiss this amended complaint. On January 11, 2022, the court denied our motion to dismiss the FTC's amended complaint. Multiple putative class actions have also been filed in state and federal courts in the United States and in the United Kingdom against us alleging violations of antitrust laws and other causes of action in connection with these acquisitions and/or other alleged anticompetitive conduct, and seeking damages and injunctive relief. Several of the cases brought on behalf of certain advertisers and users in the United States were consolidated\nin the U.S. District Court for the Northern District of California (Klein et al., v. Meta Platforms, Inc.). On January 14, 2022, the court granted, in part, and denied, in part, our motion to dismiss the consolidated actions. On March 1, 2022, a first amended consolidated complaint was filed in the putative class action brought on behalf of certain advertisers."}}
{"id": "META-2023-12-31-item_3-chunk_8", "metadata": {"metatags": ["Legal challenges", "Regulatory scrutiny"], "text": "On December 6, 2022, the court denied our motion to dismiss the first amended consolidated complaint filed in the putative class action brought on behalf of certain advertisers. In December 2022, the European Commission issued a Statement of Objections alleging that we tie Facebook Marketplace to Facebook and use data in a manner that infringes European Union competition rules. On February 6, 2019, the German Federal Cartel Office (FCO) issued an antitrust injunction order claiming that our terms and policies on data sharing across our apps, and collection from third-party websites via our business tools, breached European data protection principles and German competition law. We brought a lawsuit seeking to invalidate the order on February 11, 2019. On March 24, 2021, the Higher Regional Court, Düsseldorf, Germany referred several questions to the Court of Justice of the European Union (CJEU) including certain questions regarding interpretation of the GDPR. On July 4, 2023, the CJEU issued a decision which in particular made it more difficult to rely on \"legitimate interests,\" and \"contractual necessity\" as opposed to user \"consent,\" as a legal basis for data processing under the GDPR for ads and personalization purposes. The result of such litigation, investigations or inquiries could subject us to substantial monetary remedies and costs, interrupt or require us to change our business practices, divert resources and the attention of management from our business, or subject us to other structural or behavioral remedies that adversely affect our business."}}
{"id": "META-2023-12-31-item_3-chunk_9", "metadata": {"metatags": ["Securities litigation", "Government inquiries"], "text": "Securities and Other Actions\nBeginning on March 20, 2018, multiple putative class actions and derivative actions were filed in state and federal courts in the United States and elsewhere against us and certain of our directors and officers alleging violations of securities laws, breach of fiduciary duties, and other causes of action in connection with our platform and user data practices as well as the misuse of certain data by a developer that shared such data with third parties in violation of our terms and policies, and seeking unspecified damages and injunctive relief. Beginning on July 27, 2018, two putative class actions were filed in federal court in the United States against us and certain of our directors and officers alleging violations of securities laws in connection with the disclosure of our earnings results for the second quarter of 2018 and seeking unspecified damages. These two actions subsequently were transferred and consolidated in the U.S. District Court for the Northern District of California (In Re Facebook, Inc. Securities Litigation) with the putative securities class action described above relating to our platform and user data practices. In a series of orders in 2019 and 2020, the district court granted our motions to dismiss the plaintiffs' claims. On January 17, 2022, the plaintiffs filed a notice of appeal of the order dismissing their case, and on October 18, 2023, the U.S. Court of Appeals for the Ninth Circuit issued its decision affirming in part and reversing in part the district court's order dismissing the plaintiffs' case. We are also subject to other government inquiries and investigations relating to our business activities and disclosure practices."}}
{"id": "META-2023-12-31-item_3-chunk_10", "metadata": {"metatags": ["Government Investigations", "Class Action Lawsuits"], "text": "For example, beginning in September 2021, we became subject to government investigations and requests relating to a former employee's allegations and release of internal company documents concerning, among other things, our algorithms, advertising and user metrics, and content enforcement practices, as well as misinformation and other undesirable activity on our platform, and user well-being. We have since received additional requests relating to these and other topics. Beginning on October 27, 2021, multiple putative class actions and derivative actions were filed in the U.S. District Court for the Northern District of California against us and certain of our directors and officers alleging violations of securities laws, breach of fiduciary duties, and other causes of action in connection with the same matters, and seeking unspecified damages. On March 8, 2022, a putative class action was filed in the U.S. District Court for the Northern District of California against us and certain of our directors and officers alleging violations of securities laws in connection with the disclosure of our earnings results for the fourth quarter of 2021 and seeking unspecified damages. On July 18, 2023, the court dismissed the claims against Meta and its officers with leave to amend. On September 18, 2023, the plaintiffs filed an amended complaint.\nBeginning in January 2022, we became subject to litigation and other proceedings that were filed in various federal and state courts alleging that Facebook and Instagram cause \"social media addiction\" in users, with most proceedings focused\non those under 18 years old, resulting in various mental health and other harms."}}
{"id": "META-2023-12-31-item_3-chunk_11", "metadata": {"metatags": ["social media lawsuits", "advertising class actions"], "text": "Putative class actions have been filed in the United States and Canada on behalf of users in those jurisdictions, and numerous school districts, municipalities and one state in the United States have filed public nuisance claims based on similar allegations. On October 6, 2022, the federal cases were centralized in the U.S. District Court for the Northern District of California (In re Social Media Adolescent Addiction Product Liability Personal Injury Litigation). On October 13, 2023, in In re Social Media Cases, the Los Angeles County Superior Court presiding over the California state court proceedings sustained in part and overruled in part our demurrer as to the plaintiff's claims. Beginning in October 2023, additional U.S. states have filed lawsuits on these topics in various federal and state courts. These additional lawsuits include allegations regarding violations of the Children's Online Privacy Protection Act (COPPA) as well as violations of state laws concerning consumer protection, unfair business practices, and products liability, with proceedings focused on our alleged business practices and harms to users under 18 years old. These lawsuits seek damages and injunctive relief, and include cases filed by various state attorneys general in In re Social Media Adolescent Addiction Product Liability Personal Injury Litigation in the U.S. District Court for the Northern District of California, as well as various state courts around the country. We are also subject to government investigations and requests from multiple regulators concerning the use of our products, and the alleged mental and physical health and safety impacts on users, particularly younger users.\n\nBeginning on August 15, 2018, multiple putative class actions were filed against us alleging that we inflated our estimates of the potential audience size for advertisements, resulting in artificially increased demand and higher prices. The cases were consolidated in the U.S."}}
{"id": "META-2023-12-31-item_3-chunk_12", "metadata": {"metatags": ["class action", "legal proceedings"], "text": "In a series of rulings in 2019, 2021, and 2022, the court dismissed certain of the plaintiffs' claims, but permitted their fraud and unfair competition claims to proceed. On March 29, 2022, the court granted the plaintiffs' motion for class certification. On June 21, 2022, the U.S. Court of Appeals for the Ninth Circuit granted our petition for permission to appeal the district court's class certification order, and the court heard argument on September 12, 2023. The case is stayed in the district court pending appeal. Beginning on July 7, 2023, multiple putative class actions were filed against us in the U.S. District Court for the Northern District of California (Kadrey, et al. v. Meta Platforms, Inc. and Chabon, et al. v. Meta Platforms, Inc.) and U.S. District Court for the Southern District of New York (Huckabee, et al. v. Meta Platforms, Inc. et al., which was subsequently transferred to the U.S. District Court for the Northern District of California) alleging that we used various copyrighted books and materials to train our artificial intelligence models, and seeking unspecified damages and injunctive relief. In the first quarter of 2024, the Supreme Court is scheduled to hear argument in Vivek H. Murthy, Surgeon General, et al. v. Missouri, et al., on the question of whether federal government officials violated the First Amendment in their communications with the company and others related to content moderation practices, and to hear argument in Netchoice, et al. v. Paxton and Moody, et al. v. Netchoice et al., regarding the application of the First Amendment relating to content moderation on tech platforms. Although Meta is not a defendant in these actions, the Supreme Court's decision and ultimate resolution of the lawsuit could impact our business."}}
{"id": "META-2023-12-31-item_3-chunk_13", "metadata": {"metatags": ["Legal Proceedings", "Regulatory Compliance"], "text": "In addition, we are subject to litigation and other proceedings involving law enforcement and other regulatory agencies, including in particular in Brazil, Russia, and other countries in Europe, in order to ascertain the precise scope of our legal obligations to comply with the requests of those agencies, including our obligation to disclose user information in particular circumstances. A number of such instances have resulted in the assessment of fines and penalties against us. We believe we have multiple legal grounds to satisfy these requests or prevail against associated fines and penalties, and we intend to vigorously defend such fines and penalties. We are also party to various other legal proceedings, claims, and regulatory, tax or government inquiries and investigations that arise in the ordinary course of business, and we expect to be subject to additional legal proceedings and disputes in the future."}}
{"id": "META-2023-12-31-item_5-chunk_0", "metadata": {"metatags": ["Stock Information", "Dividend Policy"], "text": "Market Information for Common Stock\nOur Class A common stock is trading on the Nasdaq Global Select Market under the ticker symbol 'META'. This replaced the ticker symbol 'FB,' which had been used since the company's initial public offering in 2012. Prior to that time, there was no public market for our stock. Our Class B common stock is not listed on any stock exchange nor traded on any public market. Holders of Record\nAs of December 31, 2023, there were 3,098 stockholders of record of our Class A common stock, and the closing price of our Class A common stock was $353.96 per share as reported on the Nasdaq Global Select Market. Because many of our shares of Class A common stock are held by brokers and other institutions on behalf of stockholders, we are unable to estimate the total number of stockholders represented by these record holders. As of December 31, 2023, there were 23 stockholders of record of our Class B common stock. Dividend Policy\nPrior to 2024, we had never declared or paid any cash dividend on our common stock. On February 1, 2024 we announced the initiation of our first ever cash dividend program. This cash dividend of $0.50 per share of Class A common stock and Class B common stock (together, the “common stock”) is equivalent to $2.00 per share on an annual basis. The first cash dividend will be paid on March 26, 2024 to all holders of record of common stock at the close of business on February 22, 2024. The payment of future cash dividends is subject to future declaration by our board of directors, which will be based in part on continued capital availability, market conditions, applicable laws and agreements, and our board of directors continuing to determine that the declaration of dividends is in the best interests of our stockholders."}}
{"id": "META-2023-12-31-item_5-chunk_1", "metadata": {"metatags": ["Share repurchases", "Stock performance"], "text": "On November 18, 2016, we announced that our board of directors had authorized a share repurchase program of our Class A common stock, which commenced in January 2017 and does not have an expiration date. In January 2024, an additional $50 billion of repurchases was authorized under this program. The timing and actual number of shares repurchased depend on a variety of factors, including price, general business and market conditions, and other investment opportunities, and shares may be repurchased through open market purchases or privately negotiated transactions, including through the use of trading plans intended to qualify under Rule 10b5-1 under the Exchange Act.\n\nNone.\n\nThis performance graph shall not be deemed \"soliciting material\" or to be \"filed\" with the SEC for purposes of Section 18 of the Exchange Act, or otherwise subject to the liabilities under that Section, and shall not be deemed to be incorporated by reference into any filing of Meta Platforms, Inc. under the Securities Act of 1933, as amended, or the Exchange Act. The following graph shows a comparison of the cumulative total return for our Class A common stock, the Dow Jones Internet Composite Index (DJINET), the Standard & Poor's 500 Stock Index (S&P 500) and the Nasdaq Composite Index (Nasdaq Composite) for the five years ended December 31, 2023."}}
{"id": "META-2023-12-31-item_5-chunk_2", "metadata": {"metatags": ["Stock performance", "Investment comparison"], "text": "The graph assumes that $100 was invested at the market close on the last trading day for the fiscal year ended December 31, 2018 in the Class A common stock of Meta Platforms, Inc., the DJINET, the S&P 500, and the Nasdaq Composite and data for the DJINET, the S&P 500, and the Nasdaq Composite assumes reinvestments of gross dividends. The stock price performance of the following graph is not necessarily indicative of future stock price performance."}}
{"id": "META-2023-12-31-item_7-chunk_0", "metadata": {"metatags": ["Forward-looking statements", "Non-GAAP measures"], "text": "You should read the following discussion of our financial condition and results of operations in conjunction with our consolidated financial statements and the related notes included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Annual Report on Form 10-K. In addition to our historical consolidated financial information, the following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to these differences include those discussed below and elsewhere in this Annual Report on Form 10-K, particularly in Part I, Item 1A, \"Risk Factors.\" For a discussion of limitations in the measurement of certain of our community metrics, see the section entitled \"Limitations of Key Metrics and Other Data\" in this Annual Report on Form 10-K. To supplement our consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (GAAP), we present revenue on a constant currency basis and free cash flow, which are non-GAAP financial measures. Revenue on a constant currency basis is presented in the section entitled \"-Revenue-Foreign Exchange Impact on Revenue.\" To calculate revenue on a constant currency basis, we translated revenue for the full year 2023 using 2022 monthly exchange rates for our settlement or billing currencies other than the U.S. dollar. For a full description of our free cash flow non-GAAP measure, see the section entitled \"-Liquidity and Capital Resources-Free Cash Flow.\"\nThese non-GAAP financial measures are not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP."}}
{"id": "META-2023-12-31-item_7-chunk_1", "metadata": {"metatags": ["non-GAAP measures", "2023 financial results"], "text": "These measures may be different from non-GAAP financial measures used by other companies, limiting their usefulness for comparison purposes. Moreover, presentation of revenue on a constant currency basis is provided for year-over-year comparison purposes, and investors should be cautioned that the effect of changing foreign currency exchange rates has an actual effect on our operating results. We believe these non-GAAP financial measures provide investors with useful supplemental information about the financial performance of our business, enable comparison of financial results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect to key metrics used by management in operating our business.\nExecutive Overview of Full Year 2023 Results\nOur mission is to give people the power to build community and bring the world closer together. Our financial results and key community metrics for 2023 are set forth below. Our total revenue for 2023 was $134.90 billion, an increase of 16% compared to 2022, due to an increase in advertising revenue. Revenue on a constant currency basis would have increased 15% compared to 2022. Ad impressions delivered across our Family of Apps increased 28% year-over-year in 2023, partially offset by a 9% year-over-year decrease in the average price per ad. Income from operations for 2023 was $46.75 billion, an increase of $17.81 billion, or 62%, compared to 2022, driven by an increase in advertising revenue.\nConsolidated and Segment Results\nWe report our financial results for our two reportable segments: Family of Apps (FoA) and Reality Labs (RL). FoA includes Facebook, Instagram, Messenger, WhatsApp, and other services. RL includes our augmented, mixed and virtual reality related consumer hardware, software, and content."}}
{"id": "META-2023-12-31-item_7-chunk_2", "metadata": {"metatags": ["Dividend program", "Restructuring initiatives"], "text": "Dividend\nPrior to 2024, we had never declared or paid any cash dividend on our common stock. On February 1, 2024 we announced the initiation of our first ever cash dividend program. This cash dividend of $0.50 per share of Class A common stock and Class B common stock (together, the “common stock”) is equivalent to $2.00 per share on an annual basis. The first cash dividend will be paid on March 26, 2024 to all holders of record of common stock at the close of business on February 22, 2024. Restructuring\nBeginning in 2022, we initiated several measures to pursue greater efficiency and to realign our business and strategic priorities. As of December 31, 2023, we have completed the data center initiatives and the employee layoffs, and substantially completed the facilities consolidation initiatives."}}
{"id": "META-2023-12-31-item_7-chunk_3", "metadata": {"metatags": ["Active users", "Ad performance"], "text": "Family monthly active people (MAP) was 3.98 billion as of December 31, 2023, an increase of 6% year-over-year. \nFacebook daily active users (DAUs) were 2.11 billion on average for December 2023, an increase of 6% year-over-year. \nFacebook monthly active users (MAUs) were 3.07 billion as of December 31, 2023, an increase of 3% year-over-year. \nAd impressions delivered across our Family of Apps increased by 28% year-over-year in 2023, and the average price per ad decreased by 9% year-over-year in 2023. \n\nDevelopments in Advertising\nSubstantially all of our revenue is currently generated from advertising on Facebook and Instagram. We rely on targeting and measurement tools that incorporate data signals from user activity on websites and services that we do not control in order to deliver relevant and effective ads to our users. Our advertising revenue has been, and we expect will continue to be, adversely affected by reduced marketer spending as a result of limitations on our ad targeting and measurement tools arising from changes to the regulatory environment and third-party mobile operating systems and browsers."}}
{"id": "META-2023-12-31-item_7-chunk_4", "metadata": {"metatags": ["regulatory impact", "advertising changes"], "text": "In particular, legislative and regulatory developments such as the General Data Protection Regulation, including its evolving interpretation through decisions of the Court of Justice of the European Union, ePrivacy Directive, the European Digital Services Act, and U.S. state privacy laws including the California Consumer Privacy Act, as amended by the California Privacy Rights Act, have impacted our ability to use data signals in our ad products, and we expect these and other\ndevelopments such as the Digital Markets Act will have further impact in the future. As a result, we have implemented, and we will continue to implement, whether voluntarily or otherwise, changes to our products and user data practices, which reduce our ability to effectively target and measure ads. For example, in response to regulatory developments in Europe, we announced our plans to change the legal basis for behavioral advertising on Facebook and Instagram in the EU, European Economic Area, and Switzerland from \"legitimate interests\" to \"consent,\" and began offering users in the region a \"subscription for no ads\" alternative. We are continuing to engage with regulators on our new consent model. In addition, mobile operating system and browser providers, such as Apple and Google, have implemented product changes and/or announced future plans to limit the ability of websites and application developers to collect and use these signals to target and measure advertising. For example, in 2021, Apple made certain changes to its products and data use policies in connection with changes to its iOS operating system that reduce our and other iOS developers' ability to target and measure advertising, which has negatively impacted, and we expect will continue to negatively impact, the size of the budgets marketers are willing to commit to us and other advertising platforms. To mitigate these developments, we are continually working to evolve our advertising systems to improve the performance of our ad products."}}
{"id": "META-2023-12-31-item_7-chunk_5", "metadata": {"metatags": ["Advertising innovation", "Macroeconomic conditions"], "text": "We are developing privacy enhancing technologies to deliver relevant ads and measurement capabilities while reducing the amount of personal information we process, including by relying more on anonymized or aggregated third-party data. In addition, we are developing tools that enable marketers to share their data into our systems, as well as ad products that generate more valuable signals within our apps. More broadly, we also continue to innovate our advertising tools to help marketers prepare campaigns and connect with consumers, including developing growing formats such as Reels ads and our business messaging ad products. Across all of these efforts, we are making significant investments in artificial intelligence (AI), including generative AI, to improve our delivery, targeting, and measurement capabilities. Further, we are focused on driving onsite conversions in our business messaging ad products by developing new features and scaling existing features. We are also engaging with others across our industry to explore the possibility of new open standards for the private and secure processing of data for advertising purposes. We believe our ongoing improvements to ad targeting and measurement are continuing to drive improved results for advertisers. However, we expect that some of these efforts will be long-term initiatives, and that the legislative, regulatory and platform developments described above will continue to adversely impact our advertising revenue for the foreseeable future. Other Business and Macroeconomic Conditions\nOther global and regional business, macroeconomic, and geopolitical conditions also have had, and we believe will continue to have, an impact on our user growth and engagement and advertising revenue. In particular, we believe advertising budgets have been pressured from time to time by factors such as inflation, rising interest rates, and related market uncertainty, which has led to reduced marketer spending."}}
{"id": "META-2023-12-31-item_7-chunk_6", "metadata": {"metatags": ["Business uncertainty", "Advertising revenue"], "text": "While we saw improvement in business and macroeconomic conditions in 2023, continued business, macroeconomic, and geopolitical uncertainty remains, which could impact our financial results in future periods. In addition, competitive products and services have reduced some users' engagement with our products and services. We are investing in Reels and in AI initiatives across our products, including our AI-powered discovery engine to recommend relevant content, which we have already seen results in improved user engagement and monetization of our products. While Reels is growing in usage, it monetizes at a lower rate than our feed and Stories products and we expect it will continue to monetize at a lower rate for the foreseeable future. We also have seen fluctuations and declines in the size of our active user base in one or more regions from time to time. For example, in connection with the war in Ukraine, access to Facebook and Instagram was restricted in Russia and the services were then prohibited by the Russian government, which continued to adversely affect user growth and engagement in 2023. These trends adversely affected advertising revenue in 2023, and we expect will continue to affect our advertising revenue in the foreseeable future. Although we regularly evaluate a variety of sources to understand trends in our advertising revenue, we do not have perfect visibility into the factors driving advertiser spending decisions and our assessments involve complex judgments about what is driving advertising decisions across a large and diversified advertiser base across the globe. Trends impacting advertising spend are also dynamic and interrelated. As a result, it is difficult to identify with precision which advertiser spending decisions are attributable to which trends, and we are unable to quantify the exact impact that each trend had on our advertising revenue during the periods presented."}}
{"id": "META-2023-12-31-item_7-chunk_7", "metadata": {"metatags": ["Investment strategy", "Metaverse investment"], "text": "Investment Philosophy\nWe expect to continue to build on the discipline and habits that we developed in 2022 when we initiated several efforts to increase our operating efficiency, while still remaining focused on investing in significant opportunities. In 2023, 80% of our total costs and expenses were recognized in FoA and 20% were recognized in RL. Our FoA investments include expenses relating to headcount, data centers, and technical infrastructure as part of our efforts to develop our apps and our advertising services. These efforts include significant investments in AI initiatives, including to recommend relevant content across our products, enhance our advertising tools, develop new products, and develop new features for existing products using generative AI. We are also making significant investments in our metaverse efforts, including developing virtual, augmented, and mixed reality devices, software for social platforms, neural interfaces, and other foundational technologies for the metaverse. Our RL investments include expenses relating to technology development across these efforts. Many of our RL investments are directed toward long-term, cutting-edge research and development for products for the metaverse that may only be fully realized in the next decade. We expect this will be a complex, evolving, and long-term initiative, and our ability to support our metaverse efforts is dependent on generating sufficient profits from other areas of our business. We are investing now because we believe this is the next chapter of the internet and will unlock monetization opportunities for businesses, developers, and creators, including around advertising, hardware, and digital goods."}}
{"id": "META-2023-12-31-item_7-chunk_8", "metadata": {"metatags": ["Family metrics", "DAP definition"], "text": "Trends in Our Family Metrics\nThe numbers for our key Family metrics, our DAP, MAP, and average revenue per person (ARPP), do not include users on our other products unless they would otherwise qualify as DAP or MAP, respectively, based on their other activities on our Family products. Trends in the number of people in our community affect our revenue and financial results by influencing the number of ads we are able to show, the value of our ads to marketers, as well as our expenses and capital expenditures. Substantially all of our daily and monthly active people (as defined below) access our Family products on mobile devices. Daily Active People (DAP). We define a daily active person as a registered and logged-in user of Facebook, Instagram, Messenger, and/or WhatsApp (collectively, our \"Family\" of products) who visited at least one of these Family products through a mobile device application or using a web or mobile browser on a given day. We do not require people to use a common identifier or link their accounts to use multiple products in our Family, and therefore must seek to attribute multiple user accounts within and across products to individual people. Our calculations of DAP rely upon complex techniques, algorithms, and machine learning models that seek to estimate the underlying number of unique people using one or more of these products, including by matching user accounts within an individual product and across multiple products when we believe they are attributable to a single person, and counting such group of accounts as one person. As these techniques and models require significant judgment, are developed based on internal reviews of limited samples of user accounts, and are calibrated against user survey data, there is necessarily some margin of error in our estimates. We view DAP, and DAP as a percentage of MAP, as measures of engagement across our products. For additional information, see the section entitled \"Limitations of Key Metrics and Other Data.\""}}
{"id": "META-2023-12-31-item_7-chunk_9", "metadata": {"metatags": ["Active user metrics", "Metrics estimation"], "text": "Note: We report the numbers of DAP and MAP as specific amounts, but these numbers are estimates of the numbers of unique people using our products and are subject to statistical variances and errors. While we expect the error margin for these estimates to vary from period to period, we estimate that such margin generally will be approximately 3% of our worldwide MAP. At our scale, it is very difficult to attribute multiple user accounts within and across products to individual people, and it is possible that the actual numbers of unique people using our products may vary significantly from our estimates, potentially beyond our estimated error margins. In the third quarter of 2022, we updated our Family metrics calculations to maintain calibration of our models against recent user survey data, and we estimate such update contributed an aggregate of approximately 30 million DAP to our reported worldwide DAP in September 2022. Beginning in the fourth quarter of 2023, our Family metrics no longer include Messenger Kids users. Worldwide DAP increased 8% to 3.19 billion on average during December 2023 from 2.96 billion during December 2022. Monthly Active People (MAP). We define a monthly active person as a registered and logged-in user of one or more Family products who visited at least one of these Family products through a mobile device application or using a web or mobile browser in the last 30 days as of the date of measurement. We do not require people to use a common identifier or link their accounts to use multiple products in our Family, and therefore must seek to attribute multiple user accounts within and across products to individual people."}}
{"id": "META-2023-12-31-item_7-chunk_10", "metadata": {"metatags": ["MAP calculation", "error margin"], "text": "Our calculations of MAP rely upon complex techniques, algorithms, and machine learning models that seek to estimate the underlying number of unique people using one or more of these products, including by matching user accounts within an individual product and across multiple products when we believe they are attributable to a single person, and counting such group of accounts as one person. As these techniques and models require significant judgment, are developed based on internal reviews of limited samples of user accounts, and are calibrated against user survey data, there is necessarily some margin of error in our estimates. We view MAP as a measure of the size of our global active community of people using our products. Note: We report the numbers of DAP and MAP as specific amounts, but these numbers are estimates of the numbers of unique people using our products and are subject to statistical variances and errors. While we expect the error margin for these estimates to vary from period to period, we estimate that such margin generally will be approximately 3% of our worldwide MAP. At our scale, it is very difficult to attribute multiple user accounts within and across products to individual people, and it is possible that the actual numbers of unique people using our products may vary significantly from our estimates, potentially beyond our estimated error margins. In the third quarter of 2022, we updated our Family metrics calculations to maintain calibration of our models against recent user survey data, and we estimate such update contributed an aggregate of approximately 40 million MAP to our reported worldwide MAP in September 2022. Beginning in the fourth quarter of 2023, our Family metrics no longer include Messenger Kids users."}}
{"id": "META-2023-12-31-item_7-chunk_11", "metadata": {"metatags": ["User metrics", "Revenue metrics"], "text": "As of December 31, 2023, we had 3.98 billion MAP, an increase of 6% from 3.74 billion as of December 31, 2022. \n•Average Revenue Per Person (ARPP). We define ARPP as our total revenue during a given quarter, divided by the average of the number of MAP at the beginning and end of the quarter. While ARPP includes all sources of revenue, the number of MAP used in this calculation only includes users of our Family products as described in the definition of MAP above. We estimate that the share of revenue from users who are not also MAP was not material.\nTrends in Our Facebook User Metrics\nThe numbers for our key Facebook metrics, our DAUs, MAUs, and average revenue per user (ARPU), do not include users on Instagram, WhatsApp, or our other products, unless they would otherwise qualify as DAUs or MAUs, respectively, based on their other activities on Facebook. Trends in the number of users affect our revenue and financial results by influencing the number of ads we are able to show, the value of our ads to marketers, as well as our expenses and capital expenditures. Substantially all of our daily and monthly active users (as defined below) access Facebook on mobile devices. \n•Daily Active Users (DAUs)."}}
{"id": "META-2023-12-31-item_7-chunk_12", "metadata": {"metatags": ["Daily active users", "Monthly active users"], "text": "We define a daily active user as a registered and logged-in Facebook user who visited Facebook through our website or a mobile device, or used our Messenger application (and is also a registered Facebook user), on a given day. We view DAUs, and DAUs as a percentage of MAUs, as measures of user engagement on Facebook.\nNote: For purposes of reporting DAUs, MAUs, and ARPU by geographic region, Europe includes all users in Russia and Turkey and Rest of World includes all users in Africa, Latin America, and the Middle East. Worldwide DAUs increased 6% to 2.11 billion on average during December 2023 from 2.00 billion during December 2022. Users in India, Bangladesh, and Nigeria represented the top three sources of growth in DAUs during December 2023, relative to the same period in 2022. •Monthly Active Users (MAUs). We define a monthly active user as a registered and logged-in Facebook user who visited Facebook through our website or a mobile device, or used our Messenger application (and is also a registered Facebook user), in the last 30 days as of the date of measurement. MAUs are a measure of the size of our global active user community on Facebook. As of December 31, 2023, we had 3.07 billion MAUs, an increase of 3% from December 31, 2022. Users in India, Bangladesh, and Nigeria represented the top three sources of growth in 2023, relative to the same period in 2022."}}
{"id": "META-2023-12-31-item_7-chunk_13", "metadata": {"metatags": ["ARPU by region", "Revenue geography"], "text": "Trends in Our Monetization by Facebook User Geography\nWe calculate our revenue by user geography based on our estimate of the geography in which ad impressions are delivered, virtual and digital goods are purchased, or consumer hardware products are shipped. We define ARPU as our total revenue in a given geography during a given quarter, divided by the average of the number of MAUs in the geography at the beginning and end of the quarter. While ARPU includes all sources of revenue, the number of MAUs used in this calculation only includes users of Facebook and Messenger as described in the definition of MAU above. While the share of revenue from users who are not also Facebook or Messenger MAUs has grown over time, we estimate that revenue from users who are Facebook or Messenger MAUs represents the substantial majority of our total revenue. See \"Average Revenue Per Person (ARPP)\" above for our estimates of trends in our monetization of our Family products. The geography of our users affects our revenue and financial results because we currently monetize users in different geographies at different average rates. Our revenue and ARPU in regions such as United States & Canada and Europe are relatively higher primarily due to the size and maturity of those online and mobile advertising markets. For example, ARPU in 2023 in the United States & Canada region was more than 11 times higher than in the Asia-Pacific region."}}
{"id": "META-2023-12-31-item_7-chunk_14", "metadata": {"metatags": ["revenue sources", "ARPU analysis"], "text": "Ad Revenue\nNon-Ad Revenue\nNote: Non-advertising revenue includes RL revenue generated from the delivery of consumer hardware products and FoA Other revenue, which consists of revenue from WhatsApp Business Platform, net fees we receive from developers using our Payments infrastructure, and revenue from various other sources. Our revenue by user geography in the charts above is geographically apportioned based on our estimation of the geographic location of our users when they perform a revenue-generating activity. This allocation differs from our revenue disaggregated by geography disclosure in Note 2 - Revenue in our consolidated financial statements included in Part II, Item 8, \"Financial Statements and Supplemental Data\" where revenue is geographically apportioned based on the addresses of our customers. Our annual worldwide ARPU in 2023, which represents the sum of quarterly ARPU during such period, was $44.60, an increase of 13% from 2022. For 2023, ARPU increased by 21% in Europe, 20% in Rest of World, 11% in Asia-Pacific, and 10% in United States & Canada. User growth was mostly in geographies with relatively lower ARPU, such as Asia-Pacific and Rest of World. We expect that user growth in the future will be primarily concentrated in those regions where ARPU is relatively lower, such that worldwide ARPU may continue to increase at a slower rate relative to ARPU in any geographic region in a particular period, or potentially decrease even if ARPU increases in each geographic region."}}
{"id": "META-2023-12-31-item_7-chunk_15", "metadata": {"metatags": ["Accounting Estimates", "Loss Contingencies"], "text": "Critical Accounting Estimates\nOur consolidated financial statements are prepared in accordance with GAAP. The preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, costs and expenses, and related disclosures. On an ongoing basis, we evaluate our accounting estimates based on historical experience and on various other assumptions that we believe are reasonable under the circumstances. The actual impact on our financial performance could differ from these estimates under different assumptions or conditions. An accounting estimate is considered critical if both (i) the nature of the estimates or assumptions is material due to the levels of subjectivity and judgment involved, and (ii) the impact within a reasonable range of outcomes of the estimates and assumptions is material to our consolidated financial statements. We believe that the estimates and assumptions associated with loss contingencies, income taxes, and valuation of assets, when applicable, have the greatest potential impact on our consolidated financial statements. Therefore, we consider these to be our critical accounting estimates. For further information on all of our significant accounting policies, see Note 1 - Summary of Significant Accounting Policies in the accompanying notes to the consolidated financial statements.\nLoss Contingencies\nWe are involved in legal proceedings, claims, and regulatory, tax or government inquiries and investigations that arise in the ordinary course of business. Certain of these matters include speculative claims for substantial or indeterminate amounts of damages. Additionally, we are required to comply with various legal and regulatory obligations around the world, and we regularly become subject to new laws and regulations in the jurisdictions in which we operate."}}
{"id": "META-2023-12-31-item_7-chunk_16", "metadata": {"metatags": ["Legal contingencies", "Loss estimation"], "text": "The requirements for complying with these obligations may be uncertain and subject to interpretation and enforcement by regulatory and other authorities, and any failure to comply with such obligations could eventually lead to asserted legal or regulatory action. With respect to these matters, asserted and unasserted, we evaluate the associated developments on a regular basis and accrue a liability when we believe that it is both probable that a loss has been incurred and the amount can be reasonably estimated. We review the developments in our contingencies that could affect the amount of the provisions that have been previously recorded, and the matters and related reasonably possible losses disclosed. We make adjustments to our provisions and changes to our disclosures accordingly to reflect the merits of our defenses and the impact of negotiations, settlements, regulatory proceedings, rulings, advice of legal counsel, and updated information. Significant judgment is required to determine the probability of loss and the estimated amount of loss, including when and if the probability and estimate has changed for asserted and unasserted matters. Certain factors, in particular, have resulted in significant changes to these estimates and judgments in prior quarters based on updated information available. For example, in certain jurisdictions where we operate, fines and penalties may be the result of new laws and preliminary interpretations regarding the basis of assessing damages, which may make it difficult to estimate what such fines and penalties would amount to if successfully asserted against us. In addition, certain government inquiries and investigations, such as matters before our lead European Union privacy regulator, the Irish Data Protection Commission, are subject to review by other regulatory bodies before decisions are finalized, which can lead to significant changes in the outcome of an inquiry."}}
{"id": "META-2023-12-31-item_7-chunk_17", "metadata": {"metatags": ["Contingency Estimates", "Income Taxes"], "text": "As a result of these and other factors, we reasonably expect that our estimates and judgments with respect to our contingencies may continue to be revised in future quarters. The ultimate outcome of these matters, such as whether the likelihood of loss is remote, reasonably possible, or probable or if and when the reasonably possible range of loss is estimable, is inherently uncertain. Therefore, if one or more of these matters were resolved against us for amounts in excess of management's estimates of losses, our results of operations and financial condition, including in a particular reporting period in which any such outcome becomes probable and estimable, could be materially adversely affected. \n\nWe are subject to income taxes in the United States and numerous foreign jurisdictions. Significant judgment is required in determining our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in the application of accounting principles and complex tax laws. Our actual and forecasted income (loss) before\nprovision is subject to change due to economic, political and other conditions and significant judgment is required in determining our ability to recognize our net deferred tax assets. We recognize tax benefits from uncertain tax positions only if we believe that it is more likely than not that the tax position will be sustained on examination by the taxing authorities based on the technical merits of the position. These uncertain tax positions include our estimates for transfer pricing that have been developed based upon analyses of appropriate arms-length prices."}}
{"id": "META-2023-12-31-item_7-chunk_18", "metadata": {"metatags": ["Tax uncertainties", "Asset valuation"], "text": "Similarly, our estimates related to uncertain tax positions concerning research and development tax credits are based on an assessment of whether our available documentation corroborating the nature of our activities supporting the tax credits will be sufficient. Although we believe that we have adequately reserved for our uncertain tax positions (including net interest and penalties), we can provide no assurance that the final tax outcome of these matters will not be materially different, as significant judgment is required in evaluating and estimating our provision for income taxes. We make adjustments to these reserves in accordance with the income tax accounting guidance when facts and circumstances change, such as the closing of a tax audit or the refinement of an estimate. To the extent that the final tax outcome of these matters is different from the amounts recorded, such differences will affect the provision for income taxes in the period in which such determination is made, and could have a material impact on our financial condition and operating results. Valuation of Assets\nThe valuation and impairment assessment of certain assets, including recoverability, requires significant judgment and assumptions such as estimation of future cash flows, discount rates, market data of comparable assets and companies, holding period and residual value of asset groups, among others. Impairment testing for long-lived-assets, including property and equipment and operating lease right-of-use assets, occurs whenever events or circumstances indicate that the carrying amount of such assets may not be recoverable compared to the future undiscounted cash flows the assets are expected to generate from the use and eventual disposition. The impairment test is performed at the asset group level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities."}}
{"id": "META-2023-12-31-item_7-chunk_19", "metadata": {"metatags": ["Asset Impairment", "Equity Securities"], "text": "When the test results indicate that the carrying amount of long-lived assets is not recoverable, the carrying amount of such assets is reduced to fair value. Impairment testing for non-marketable equity securities without readily determinable fair values accounted for using the measurement alternative, is performed at each reporting date to determine whether there are triggering events for impairment. Such qualitative assessment considers factors such as, but not limited to, the investee's financial condition and business outlook; industry and sector performance; regulatory, economic or technological environment; operational and financing cash flows; and other relevant events and factors affecting the investee. When indicators of impairment exist, we estimate the fair value of our non-marketable equity securities using the market approach and/or the income approach and recognize impairment loss in our consolidated statements of income if the estimated fair value is less than the carrying value. In addition, for these non-marketable equity securities, determining whether a non-marketable equity security issued by the same issuer is similar to the non-marketable equity security we hold may require judgment in (a) assessment of differences in rights and obligations associated with the instruments such as voting rights, distribution rights and preferences, and conversion features, and (b) adjustments to the observable price for differences such as, but not limited to, rights and obligations, control premium, liquidity, or principal or most advantageous markets. The identification of observable transactions will depend on the timely reporting of these transactions from our investee companies, which may occur in a period subsequent to when the transactions take place. Therefore, our fair value adjustment for these observable transactions may occur in a period subsequent to when the transaction actually occurred."}}
{"id": "META-2023-12-31-item_7-chunk_20", "metadata": {"metatags": ["Advertising Revenue", "Revenue Sources"], "text": "We generate substantially all of our revenue from advertising. Our advertising revenue is generated by displaying ad products on Facebook, Instagram, Messenger, and third-party mobile applications. Marketers pay for ad products either directly or through their relationships with advertising agencies or resellers, based on the number of impressions delivered or the number of actions, such as clicks, taken by users. We recognize revenue from the display of impression-based ads in the contracted period in which the impressions are delivered. Impressions are considered delivered when an ad is displayed to a user. We recognize revenue from the delivery of action-based ads in the period in which a user takes the action the marketer contracted for. The number of ads we show is subject to methodological changes as we continue to evolve our ads business and the structure of our ads products. In particular, the ads we show may vary by product (for example, our video and Reels products are not currently monetized at the same rate as our feed or Stories products), and from time to time we increase or decrease the number or frequency of ads we show as part of our product and monetization strategies. We calculate average price per ad as total advertising revenue divided by the number of ads delivered, representing the average price paid per ad by a marketer regardless of their desired objective such as impression or action. For advertising revenue arrangements where we are not the principal, we recognize revenue on a net basis. Other revenue consists of revenue from WhatsApp Business Platform, net fees we receive from developers using our Payments infrastructure and revenue from various other sources. Reality Labs (RL)\nRL revenue is generated from the delivery of consumer hardware products, such as Meta Quest, wearables, and related software and content. Cost of Revenue and Operating Expenses\nCost of revenue. Our cost of revenue consists of expenses associated with the delivery and distribution of our products."}}
{"id": "META-2023-12-31-item_7-chunk_21", "metadata": {"metatags": ["R&D expenses", "marketing/sales"], "text": "Research and development expenses consist mostly of payroll and related expenses which include share-based compensation, RL technology development costs, facilities-related costs for employees on our engineering and technical teams who are responsible for developing new products as well as improving existing products, and restructuring charges. Marketing and sales. Marketing and sales expenses consist mainly of marketing and promotional expenses as well as payroll and related expenses which include share-based compensation for our employees engaged in sales, sales support, marketing, business development, and customer service functions. Our marketing and sales expenses also include professional services such as content reviewers to support our community and product operations and restructuring charges. General and administrative."}}
{"id": "META-2023-12-31-item_7-chunk_22", "metadata": {"metatags": ["Admin Expenses", "Revenue Increase"], "text": "General and administrative expenses consist primarily of legal-related costs, which include estimated fines, settlements, or other losses in connection with legal and related matters, as well as other legal fees; payroll and related expenses which include share-based compensation for certain of our executives as well as our legal, finance, human resources, corporate communications and policy, and other administrative employees; other taxes, such as digital services taxes and other non-income-based tax levies; professional services and restructuring charges.\nIn this section, we discuss the results of our operations for the year ended December 31, 2023 compared to the year ended December 31, 2022. For a discussion of the year ended December 31, 2022 compared to the year ended December 31, 2021, please refer to Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report on Form 10-K for the year ended December 31, 2022.\nFoA revenue in 2023 increased $18.56 billion, or 16%, compared to 2022. The increase was almost entirely driven by advertising revenue.\nAdvertising revenue in 2023 increased $18.31 billion, or 16%, compared to 2022 due to an increase in the number of ads delivered, partially offset by a decrease in the average price per ad. In 2023, the number of ads delivered increased by 28%, as compared with an 18% increase in 2022 as ads impressions grew in all regions during 2023, especially in Asia-Pacific and Rest of World."}}
{"id": "META-2023-12-31-item_7-chunk_23", "metadata": {"metatags": ["Ad performance", "Revenue seasonality"], "text": "The increase in the ads delivered during 2023 was driven by increases in the number and frequency of ads displayed across our products and an increase in users. In 2023, the average price per ad decreased by 9%, as compared with a decrease of 16% in 2022. The decrease in average price per ad was driven by an increase in the number of ads delivered, especially in geographies and in products, such as Reels, that monetize at lower rates. While the average price per ad declined year-over-year, we believe the improvements to our ad targeting and measurement tools have had a favorable impact on our ad performance and advertising demand. Other factors are also discussed in the section entitled \"-Executive Overview of Full Year 2023 Results.\" In addition, year-over-year advertising revenue growth for the full year 2023 was driven mainly by marketer spending in online commerce, which benefited from marketers based in China, consumer packaged goods, and entertainment and media. We anticipate that future advertising revenue will be driven by a combination of price and the number of ads delivered. \nRevenue Seasonality\nRevenue is traditionally seasonally strong in the fourth quarter of each year due in part to seasonal holiday demand. We believe that this seasonality in both advertising revenue and RL consumer hardware sales affects our quarterly results, which generally reflect significant growth in revenue between the third and fourth quarters and a decline between the fourth and subsequent first quarters."}}
{"id": "META-2023-12-31-item_7-chunk_24", "metadata": {"metatags": ["revenue changes", "expense increase"], "text": "For instance, our total revenue increased 17%, 16%, and 16% between the third and fourth quarters of 2023, 2022, and 2021, respectively, while total revenue for the first quarters of 2023, 2022, and 2021 declined 11%, 17%, and 7% compared to the fourth quarters of 2022, 2021, and 2020 respectively.\nForeign Exchange Impact on Revenue\nChanges in foreign exchange rates had a favorable impact on our total revenue in the full year 2023 compared to the same period in 2022. If we had translated revenue for the full year 2023 using the prior year's monthly exchange rates for our settlement or billing currencies other than the U.S. dollar, our total revenue and advertising revenue would have been $134.53 billion and $131.57 billion, respectively. Using these constant rates, total revenue and advertising revenue would have been $374 million and $379 million lower than actual total revenue and advertising revenue, respectively, for the full year 2023. Using the same constant rates, full year 2023 total revenue and advertising revenue would have been $17.92 billion and $17.93 billion higher than actual total revenue and advertising revenue, respectively, for the full year 2022.\nCost of revenue\nCost of revenue in 2023 increased $710 million, or 3%, compared to 2022. The increase was primarily driven by higher operational expenses related to our data centers and technical infrastructure, partially offset by a decrease in data center abandonment charges related to restructuring and lower content costs.\nResearch and development\nResearch and development expenses in 2023 increased $3.15 billion, or 9%, compared to 2022. The increase was primarily from higher payroll and related expenses driven by an increase in share-based compensation expenses."}}
{"id": "META-2023-12-31-item_7-chunk_25", "metadata": {"metatags": ["Expense Decreases", "Income Taxes"], "text": "Marketing and sales\nMarketing and sales expenses in 2023 decreased $2.96 billion, or 19%, compared to 2022. The decrease was mainly due to decreases in marketing and promotional expenses as well as payroll and related expenses. The payroll and related expenses decreased as a result of a decrease in employee headcount from December 31, 2022 to December 31, 2023 in our marketing and sales functions. General and administrative\nGeneral and administrative expenses in 2023 decreased $408 million, or 3%, compared to 2022. The decrease was mainly due to lower payroll and related expenses, as a result of a decrease in employee headcount from December 31, 2022 to December 31, 2023 in our general and administrative functions.\nInterest and other income (expense), net\nInterest and other income (expense), net in 2023 increased $802 million compared to 2022. The increase in interest income was due to a combination of higher interest rates and higher balances, compared to the same period in 2022. Changes in other income (expense), net were mostly related to gains (losses) recognized for our equity investments. Provision for income taxes\nOur provision for income taxes in 2023 increased $2.71 billion, or 48%, compared to 2022, due to an increase in income before provision for income taxes."}}
{"id": "META-2023-12-31-item_7-chunk_26", "metadata": {"metatags": ["Effective tax rate", "Tax law changes"], "text": "Our effective tax rate in 2023 decreased compared to 2022, primarily due to excess tax benefits recognized from share-based compensation in 2023 and the effect of additional guidance issued by the Internal Revenue Service (IRS) providing temporary relief on foreign tax credits. This was partially offset by a decrease in the proportion of U.S. tax benefits from foreign-derived intangible income relative to income before provision for income taxes and additional clarification issued by the IRS in September 2023 regarding research and development expenses subject to mandatory capitalization and amortization. Our effective tax rate in the future will depend upon the proportion between the following items and income before provision for income taxes: U.S. tax benefits from foreign-derived intangible income, tax effects from share-based compensation, research tax credit, tax effects from capital losses not expected to be utilized, restructurings, settlement of tax contingency items, tax effects of changes in our business, and the effects of changes in tax law. The accounting for share-based compensation may increase or decrease our effective tax rate based upon the difference between our share-based compensation expense and the deductions taken on our tax return, which depend upon the stock price at the time of employee award vesting. If our stock price remains constant to the January 26, 2024 price, and absent any changes to U.S. tax law, we expect our effective tax rate for the full year 2024 to be in the mid-teens. This includes the effects of the mandatory capitalization and amortization of research and development expenses incurred in 2023, as required by the 2017 Tax Cuts and Jobs Act (Tax Act). The mandatory capitalization requirement increased our 2023 cash tax liabilities materially but also decreased our effective tax rate due to increasing the foreign-derived intangible income deduction."}}
{"id": "META-2023-12-31-item_7-chunk_27", "metadata": {"metatags": ["Uncertain tax positions", "Liquidity sources"], "text": "If the mandatory capitalization is deferred, our effective tax rate in 2024 could be higher when compared to current law and our cash tax liabilities could be lower. Unrecognized Tax Benefits. As of December 31, 2023, we had net uncertain tax positions of $6.95 billion which were accrued as other liabilities. These unrecognized tax benefits were predominantly accrued for uncertainties related to transfer pricing with our foreign subsidiaries, which includes licensing of intellectual property, providing services and other transactions, as well as for uncertainties regarding the utilization of our research tax credits. The ultimate settlement of the liabilities will depend upon resolution of tax audits, litigation, or events that would otherwise change the assessment of such items. Based upon the status of litigation described below and the current status of tax audits in various jurisdictions, we do not anticipate a material change to such amounts within the next 12 months.\nLiquidity and Capital Resources\nOur principal sources of liquidity are our cash, cash equivalents, marketable securities, and cash generated from operations. Cash, cash equivalents, and marketable securities are comprised of cash on deposit with banks, time deposits, money market funds, U.S. government and agency securities, and investment grade corporate debt securities. As part of our cash management strategy, we concentrate cash deposits with large financial institutions and our investment holdings are in diversified highly rated securities."}}
{"id": "META-2023-12-31-item_7-chunk_28", "metadata": {"metatags": ["cash flow", "capital expenditures"], "text": "The increase was mostly due to $71.11 billion of cash generated from operations, and $8.46 billion of net proceeds from the issuance of fixed-rate senior unsecured notes (the Notes) in May 2023. These increases were partially offset by $28.10 billion for capital expenditures, including principal payments on finance leases, $19.77 billion for repurchases of our Class A common stock, and $7.01 billion of taxes paid related to net share settlement of employee restricted stock unit (RSU) awards.\n\nCash provided by operating activities during 2023 mostly consisted of $39.10 billion net income adjusted for certain non-cash items, such as $14.03 billion of share-based compensation expense and $11.18 billion of depreciation and amortization expense, as well as $3.29 billion of favorable changes in working capital. The increase in cash flows from operating activities during 2023 compared to 2022 was mostly due to an increase in cash collection from our customers driven by the increase in revenue, and a decrease in payments to our vendors.\n\nCash used in investing activities during 2023 mostly consisted of $27.05 billion of net purchases of property and equipment as we continued to invest in data centers, servers, and network infrastructure, partially offset by $3.20 billion net proceeds from maturities and sales of marketable debt securities. The decrease in cash used in investing activities during 2023 compared to 2022 was mostly due to a decrease in purchases of property and equipment. We anticipate making capital expenditures of approximately $30 billion to $37 billion in 2024.\n\nCash used in financing activities during 2023 mostly consisted of $19.77 billion for repurchases of our Class A common stock and $7.01 billion of taxes paid related to net share settlement of RSUs, partially offset by $8.46 billion proceeds from the issuance of the Notes in May 2023."}}
{"id": "META-2023-12-31-item_7-chunk_29", "metadata": {"metatags": ["cash flow", "free cash flow"], "text": "The decrease in cash used in financing activities during 2023 compared to 2022 was mainly due to a decrease in cash paid for repurchases of our Class A common stock, partially offset by an increase in taxes paid related to net share settlement of employee RSU awards and a decrease in net proceeds from our debt offerings.\n\nIn addition to other financial measures presented in accordance with U.S. GAAP, we monitor free cash flow (FCF) as a non-GAAP measure to manage our business, make planning decisions, evaluate our performance, and allocate resources. We define FCF as net cash provided by operating activities reduced by net purchases of property and equipment and principal payments on finance leases. We believe that FCF is one of the key financial indicators of our business performance over the long term and provides useful information regarding how cash provided by operating activities compares to the property and equipment investments required to maintain and grow our business. We have chosen our definition for FCF because we believe that this methodology can provide useful supplemental information to help investors better understand underlying trends in our business. We use FCF in discussions with our senior management and board of directors. FCF has limitations as an analytical tool, and you should not consider it in isolation or as a substitute for analysis of other GAAP financial measures, such as net cash provided by operating activities. FCF is not intended to represent our residual cash flow available for discretionary expenses. Some of the limitations of FCF are:\nFCF does not reflect our future contractual commitments; and\nother companies in our industry present similarly titled measures differently than we do, limiting their usefulness as comparative measures."}}
{"id": "META-2023-12-31-item_7-chunk_30", "metadata": {"metatags": ["Liquidity & Capital", "Debt Obligations"], "text": "Management compensates for the inherent limitations associated with using the FCF measure through disclosure of such limitations, presentation of our financial statements in accordance with GAAP, and reconciliation of FCF to the most directly comparable GAAP measure, net cash provided by operating activities, as presented below. \nMaterial Cash Requirements\nWe currently anticipate that our available funds and cash flow from operations and financing activities will be sufficient to meet our operational cash needs and fund our share repurchases and dividend payments for at least the next 12 months and thereafter for the foreseeable future. We continuously evaluate our liquidity and capital resources, including our access to external capital, to ensure we can finance our future capital requirements. Leases and Contractual Commitments\nOur operating lease obligations mostly include offices, data centers, and colocations. Our finance lease obligations include certain network infrastructure. Our facilities consolidation restructuring efforts did not materially change our operating lease obligations. Our contractual commitments are primarily related to our investments in servers, network infrastructure, and consumer hardware products in Reality Labs. Long-term Debt\nAs of December 31, 2023, we had outstanding long-term debt in the form of senior unsecured notes for an aggregate principal amount of $18.50 billion. These notes were issued in multiple series, which mature from 2027 through 2063. Short-term and long-term future interest payments obligations as of December 31, 2023 are $848 million and $16.40 billion, respectively. Net proceeds from the offerings are used for general corporate purposes, which may include, but are not limited to, capital expenditures, share repurchases, dividend payments, acquisitions or investments."}}
{"id": "META-2023-12-31-item_7-chunk_31", "metadata": {"metatags": ["Share Repurchase", "Cash Dividend"], "text": "Share Repurchase\nOur board of directors has authorized a share repurchase program of our Class A common stock, which commenced in January 2017 and does not have an expiration date. In 2023, we repurchased and subsequently retired 92 million shares of our Class A common stock for an aggregate amount of $20.03 billion, which includes the 1% excise tax accruals as a result of the Inflation Reduction Act of 2022. As of December 31, 2023, $30.93 billion remained available and authorized for repurchases. In January 2024, an additional $50 billion of repurchases was authorized under this program. Dividend\nOn February 1, 2024, we announced the initiation of our first ever cash dividend program. This cash dividend of $0.50 per share of common stock is equivalent to $2.00 per share on an annual basis. The first cash dividend will be paid on March 26, 2024 to all holders of record of common stock at the close of business on February 22, 2024. Subject to legally available funds and future declaration by our board of directors, we currently intend to continue to pay a quarterly cash dividend on our outstanding Class A common stock and Class B common stock. The declaration and payment of future dividends is at the sole discretion of our board of directors after taking into account various factors, including our financial condition, operating results, available cash, and current and anticipated cash needs. Taxes\nCash paid for income taxes was $6.61 billion for the year ended December 31, 2023. As of December 31, 2023, we had taxes payable of $1.14 billion related to a one-time transition tax payable incurred as a result of the Tax Act, of which $575 million is due within one year. As permitted by the Tax Act, we will pay the transition tax in annual interest-free installments through 2025. Our other liabilities also include $6.95 billion related to the uncertain tax positions as of December 31, 2023."}}
{"id": "META-2023-12-31-item_7-chunk_32", "metadata": {"metatags": ["Tax uncertainties", "Loss contingencies"], "text": "Due to uncertainties in the timing of the completion of tax audits, the timing of the resolution of these positions is uncertain and we are unable to make a reasonably reliable estimate of the timing of payments. Loss Contingencies\nWe are involved in legal proceedings, claims, and regulatory, tax or government inquiries and investigations. We record a liability when we believe that it is both probable that a liability has been incurred, and that the amount can be reasonably estimated. If we determine there is a reasonable possibility that we may incur a loss and the loss or range of loss can be estimated, we disclose the possible loss in the accompanying notes to the consolidated financial statements to the extent material. Significant judgment is required to determine both probability and the estimated amount of loss. Such matters are inherently unpredictable and subject to significant uncertainties, some of which are beyond our control. Should any of these estimates and assumptions change or prove to be incorrect, it could have a material impact on our results of operations, financial position, and cash flows."}}
{"id": "META-2023-12-31-item_7A-chunk_0", "metadata": {"metatags": ["Currency exchange risk", "Interest rate risk"], "text": "We are exposed to market risks, including changes to foreign currency exchange rates, interest rates, and equity price risk. Foreign Currency Exchange Risk\nWe have foreign currency risks related to our revenue and operating expenses denominated in currencies other than the U.S. dollar, primarily the Euro. Accordingly, changes in exchange rates, and in particular a strengthening of the U.S. dollar, have in the past, and may in the future, negatively affect our revenue and other operating results as expressed in U.S. dollars. See Management's Discussion and Analysis of Financial Condition and Results of Operations - Foreign Exchange Impact on Revenue section included in Part II, Item 7 of this Annual Report on Form 10-K for additional information. We have experienced and will continue to experience fluctuations in our net income as a result of transaction gains or losses related to remeasuring monetary asset and liability balances that are denominated in currencies other than the functional currency of the entities in which they are recorded. At this time, we have not entered into, but in the future we may enter into, derivatives or other financial instruments in an attempt to hedge our foreign currency exchange risk. It is difficult to predict the effect hedging activities would have on our results of operations. Interest Rate Sensitivity\nOur exposure to changes in interest rates relates primarily to interest income and market value of our cash equivalents, marketable debt securities, and the fair value of our long-term debt. Our cash, cash equivalents, and marketable debt securities consist of cash, time deposits, money market funds, U.S. government securities, U.S. government agency securities, and investment grade corporate debt securities."}}
{"id": "META-2023-12-31-item_7A-chunk_1", "metadata": {"metatags": ["Interest rate risk", "Equity price risk"], "text": "Our investment policy and strategy are focused on preservation of capital and supporting our liquidity requirements. Changes in U.S. interest rates affect the interest earned on our cash, cash equivalents, and marketable securities, and the market value of those securities. A hypothetical 100 basis point increase in market interest rates would have resulted in a decrease of $355 million and $558 million in the market value of our available-for-sale debt securities and cash equivalents as of December 31, 2023 and 2022, respectively. Any realized gains or losses resulting from such interest rate changes and from the current unrealized gains or losses would only occur if we sold the investments prior to maturity. As of December 31, 2023 and 2022, we also had aggregate principal amounts of fixed-rate senior notes (the Notes) outstanding of $18.50 billion and $10.00 billion, respectively. Since our Notes bear interest at fixed rates and are carried at amortized cost, fluctuations in interest rates do not have any impact on our consolidated financial statements. However, the fair value of the Notes will fluctuate with movements in market interest rates, increasing in periods of declining interest rates and declining in periods of increasing interest rates. Equity Price Risk\nOur equity investments are in non-marketable equity securities and are subject to equity price risks that could have a material impact on the carrying value of our holdings. Our non-marketable equity securities are investments in privately-held companies without readily determinable fair values. We elected to account for substantially all of our non-marketable equity securities using the measurement alternative, which is cost, less any impairment, adjusted for changes in fair value resulting from observable transactions for identical or similar investments of the same issuer. We perform a qualitative assessment at each reporting date to determine whether there are triggering events for impairment."}}
{"id": "META-2023-12-31-item_7A-chunk_2", "metadata": {"metatags": ["Equity valuation", "Economic uncertainties"], "text": "The qualitative assessment considers factors such as, but not limited to, the investee's financial condition and business outlook; industry and sector performance; economic or technological environment; and other relevant events and factors affecting the investee. Valuations of our non-marketable equity securities are complex due to the lack of readily available market data and observable transactions. Uncertainties in the global economic climate and financial markets could adversely impact the valuation of these companies we invest in and, therefore, result in a material impairment or downward adjustment in our investments."}}
{"id": "META-2023-12-31-item_8-chunk_0", "metadata": {"metatags": ["Financial statements", "Audit opinion"], "text": "Report of Independent Registered Public Accounting Firm\n\nTo the Stockholders and the Board of Directors of Meta Platforms, Inc. Opinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Meta Platforms, Inc. (the Company) as of December 31, 2023 and 2022, the related consolidated statements of income, comprehensive income, stockholders' equity and cash flows for each of the three years in the period ended December 31, 2023, and the related notes (collectively referred to as the \"consolidated financial statements\"). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at December 31, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended December 31, 2023, in conformity with U.S. generally accepted accounting principles. We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of December 31, 2023, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), and our report dated February 1, 2024, expressed an unqualified opinion thereon. Basis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits."}}
{"id": "META-2023-12-31-item_8-chunk_1", "metadata": {"metatags": ["Audit matters", "Financial statements"], "text": "The critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the Audit & Risk Oversight Committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate."}}
{"id": "META-2023-12-31-item_8-chunk_2", "metadata": {"metatags": ["loss contingencies", "audit procedures"], "text": "Loss Contingencies\nDescription of the Matter As described in Note 12 to the consolidated financial statements, the Company is party to various legal proceedings, claims, and regulatory or government inquiries and investigations. The Company accrues a liability when it believes a loss is probable and the amount can be reasonably estimated. In addition, the Company believes it is reasonably possible that it will incur a loss in some of these cases, actions or inquiries described above. When applicable, the Company discloses an estimate of the amount of loss or range of possible loss that may be incurred. However, for certain other matters, the Company discloses that the amount of such losses or a range of possible losses cannot be reasonably estimated at this time. Auditing the Company's accounting for, and disclosure of, these loss contingencies was especially challenging due to the significant judgment required to evaluate management's assessments of the likelihood of a loss, and their estimate of the potential amount or range of such losses. How We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the identification and evaluation of these matters, including controls relating to the Company's assessment of the likelihood that a loss will be realized and their ability to reasonably estimate the potential range of possible losses. Our audit procedures included reading the minutes or a summary of the meetings of the committees of the board of directors, reading the proceedings, claims, and regulatory, or government inquiries and investigations, or summaries as we deemed appropriate, requesting and receiving internal and external legal counsel confirmation letters, meeting with internal and external legal counsel to discuss the nature of the various matters, and obtaining representations from management."}}
{"id": "META-2023-12-31-item_8-chunk_3", "metadata": {"metatags": ["Uncertain tax", "IRS position"], "text": "We also evaluated the appropriateness of the related disclosures included in Note 12 to the consolidated financial statements. Uncertain Tax Positions\nDescription of the Matter\nAs discussed in Note 15 to the consolidated financial statements, the Company has received certain notices from the Internal Revenue Service (IRS) related to transfer pricing agreements with the Company's foreign subsidiaries for certain periods examined. The IRS has stated that it will also apply its position to tax years subsequent to those examined. If the IRS prevails in its position, it could result in an additional federal tax liability, plus interest and any penalties asserted. The Company uses judgment to (1) determine whether a tax position's technical merits are more-likely-than-not to be sustained and (2) measure the amount of tax benefit that qualifies for recognition. Auditing the Company's accounting for, and disclosure of, these uncertain tax positions was especially challenging due to the significant judgment required to assess management's evaluation of technical merits and the measurement of the tax position based on interpretations of tax laws and legal rulings. How We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of controls over the Company's process to assess the technical merits of tax positions related to these transfer pricing agreements and to measure the benefit of those tax positions. As part of our audit procedures over the Company's accounting for these positions, we involved our tax professionals to assist with our assessment of the technical merits of the Company's tax positions. This included assessing the Company's correspondence with the relevant tax authorities, evaluating income tax opinions or other third-party advice obtained by the Company, and requesting and receiving confirmation letters from third-party advisors."}}
{"id": "META-2023-12-31-item_8-chunk_4", "metadata": {"metatags": ["Tax positions", "Tax disclosures"], "text": "We also used our knowledge of, and experience with, the application of international and local income tax laws by the relevant income tax authorities to evaluate the Company's accounting for those tax positions. We analyzed the Company's assumptions and data used to determine the amount of the federal tax liability recognized and tested the mathematical accuracy of the underlying data and calculations. We also evaluated the appropriateness of the related disclosures included in Note 15 to the consolidated financial statements in relation to these matters."}}
{"id": "META-2023-12-31-item_8-chunk_5", "metadata": {"metatags": ["Internal control", "Financial reporting"], "text": "The Company's management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Management's Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Company's internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. We conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion. Definition and Limitations of Internal Control Over Financial Reporting\nA company's internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles."}}
{"id": "META-2023-12-31-item_8-chunk_6", "metadata": {"metatags": ["Internal control", "Financial reporting"], "text": "A company's internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the company's assets that could have a material effect on the financial statements. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate."}}
{"id": "META-2023-12-31-item_8-chunk_7", "metadata": {"metatags": ["Business Overview", "Financial Statements"], "text": "Organization and Description of Business\nWe were incorporated in Delaware in July 2004. Our mission is to give people the power to build community and bring the world closer together. All of our products, including our apps, share the vision of helping to bring the metaverse to life. We report our financial results based on two reportable segments: Family of Apps (FoA) and Reality Labs (RL). The segment information aligns with how the chief operating decision maker (CODM), who is our chief executive officer (CEO), reviews and manages the business. We generate substantially all of our revenue from advertising. \n\nBasis of Presentation\nWe prepared the consolidated financial statements in accordance with U.S. generally accepted accounting principles (GAAP). The consolidated financial statements include the accounts of Meta Platforms, Inc., its subsidiaries where we have controlling financial interests, and any variable interest entities for which we are deemed to be the primary beneficiary. All intercompany balances and transactions have been eliminated. \n\nUse of Estimates\nPreparation of consolidated financial statements in conformity with GAAP requires the use of estimates and judgments that affect the reported amounts in the consolidated financial statements and accompanying notes. These estimates form the basis for judgments we make about the carrying values of our assets and liabilities, which are not readily apparent from other sources. We base our estimates and judgments on historical information and on various other assumptions that we believe are reasonable under the circumstances."}}
{"id": "META-2023-12-31-item_8-chunk_8", "metadata": {"metatags": ["Accounting estimates", "Revenue recognition"], "text": "GAAP requires us to make estimates and judgments in several areas, including, but not limited to, those related to loss contingencies, income taxes, valuation of long-lived assets and their associated estimated useful lives, valuation of non-marketable equity securities, revenue recognition, valuation of goodwill, credit losses of available-for-sale (AFS) debt securities and accounts receivable, and fair value of financial instruments and leases. These estimates are based on management's knowledge about current events, interpretation of regulations, and expectations about actions we may undertake in the future. Actual results could differ materially from those estimates.\nRevenue Recognition\nWe recognize revenue under Accounting Standards Codification (ASC) 606 Revenue From Contracts With Customers. Revenue is recognized when control of the promised goods or services is transferred to our customers, in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services. Sales commissions we pay in connection with contracts are expensed when incurred because the amortization period is one year or less. These costs are recorded within marketing and sales on our consolidated statements of income. We do not disclose the value of unsatisfied performance obligations for contracts with an original expected length of one year or less. Revenue includes sales and usage-based taxes, except for cases where we are acting as a pass-through agent.\nAdvertising Revenue\nAdvertising revenue is generated by displaying ad products on Facebook, Instagram, Messenger, and third-party mobile applications. Marketers pay for ad products either directly or through their relationships with advertising agencies or resellers, based on the number of impressions delivered or the number of actions, such as clicks, taken by our users. We recognize revenue from the display of impression-based ads in the contracted period in which the impressions are delivered."}}
{"id": "META-2023-12-31-item_8-chunk_9", "metadata": {"metatags": ["revenue recognition", "advertising revenue"], "text": "Impressions are considered delivered when an ad is displayed to users. We recognize revenue from the delivery of action-based ads in the period in which a user takes the action the marketer contracted for. In general, we report advertising\nrevenue on a gross basis, since we control the advertising inventory before it is transferred to our customers. Our control is evidenced by our sole ability to monetize the advertising inventory before it is transferred to our customers. For revenue generated from arrangements that involve third-parties, we evaluate whether we are the principal, and report revenue on a gross basis, or the agent, and report revenue on a net basis. In this assessment, we consider if we obtain control of the specified goods or services before they are transferred to the customer, as well as other indicators such as the party primarily responsible for fulfillment, inventory risk, and discretion in establishing price. We may accept lower consideration than the amount promised per the contract for certain revenue transactions and certain customers may receive cash-based incentives, credits, or refunds, which are accounted for as variable consideration when estimating the amount of revenue to recognize. We estimate these amounts and reduce revenue based on the amounts expected to be provided to customers. We believe that there will not be significant changes to our estimates of variable consideration.\nRL revenue is generated from the delivery of consumer hardware products, such as Meta Quest, wearables, and related software and content. Revenue is recognized at the time control of the products is transferred to customers, which is generally at the time of delivery, in an amount that reflects the consideration RL expects to be entitled to in exchange for the products.\nOther revenue consists of revenue from WhatsApp Business Platform, net fees we receive from developers using our Payments infrastructure, and revenue from various other sources."}}
{"id": "META-2023-12-31-item_8-chunk_10", "metadata": {"metatags": ["Cost of revenue", "Content costs"], "text": "Our cost of revenue consists of expenses associated with the delivery and distribution of our products. These mainly include expenses related to the operation of our data centers and technical infrastructure, such as depreciation expense from servers, network infrastructure and buildings, as well as payroll and related expenses which include share-based compensation for employees on our operations teams, and energy and bandwidth costs. Cost of revenue also includes costs associated with partner arrangements, including traffic acquisition costs and credit card and other fees related to processing customer transactions; RL inventory costs, which consist of cost of products sold and estimated losses on non-cancelable contractual commitments; and content costs.\n\nOur content costs are mostly related to payments to content providers from whom we license video and music to increase engagement on the platform. We pay fees to these content providers based on revenue generated, a flat fee, or both. For licensed video, we expense the cost per title when the title is accepted and available for viewing if the capitalization criteria are not met. Video content costs that meet the criteria for capitalization were not material to date. For licensed music, we expense the license fees over the contractual license period. We pay fees to music partners based on revenue generated, minimum guaranteed fees, flat fees, or a combination thereof. Expensed content costs are included in cost of revenue on our consolidated statements of income.\n\nSoftware development costs, including costs to develop software products or the software component of products to be marketed or sold to external users, are expensed before the software or technology reach technological feasibility, which is typically reached shortly before the release of such products."}}
{"id": "META-2023-12-31-item_8-chunk_11", "metadata": {"metatags": ["Software Development", "Income Taxes"], "text": "Software development costs also include costs to develop software to be used solely to meet internal needs and applications used to deliver our services. These software development costs meet the criteria for capitalization once the preliminary project stage is complete and it is probable that the project will be completed and the software will be used to perform the function intended. Software development costs that meet the criteria for capitalization were not material to date. Share-based Compensation\nShare-based compensation expense consists of the company's restricted stock units (RSUs) expense. RSUs granted to employees are measured based on the grant-date fair value. In general, our RSUs vest over a service period of four years. Share-based compensation expense is generally recognized based on the straight-line basis over the requisite service period and forfeitures are accounted for as they occur. Income Taxes\nWe are subject to income taxes in the United States and numerous foreign jurisdictions. Significant judgment is required in determining our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in the application of accounting principles and complex tax laws. We record a provision for income taxes for the anticipated tax consequences of the reported results of operations using the asset and liability method. Under this method, we recognize deferred income tax assets and liabilities for the expected future consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, as well as for loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using the tax rates that are expected to apply to taxable income for the years in which those tax assets and liabilities are expected to be realized or settled. We recognize the deferred income tax effects of a change in tax rates in the period of the enactment."}}
{"id": "META-2023-12-31-item_8-chunk_12", "metadata": {"metatags": ["Deferred tax assets", "Cash equivalents"], "text": "We record a valuation allowance to reduce our deferred tax assets to the net amount that we believe is more likely than not to be realized. We consider all available evidence, both positive and negative, including historical levels of income, expectations and risks associated with estimates of future taxable income and ongoing tax planning strategies in assessing the need for a valuation allowance. We recognize tax benefits from uncertain tax positions only if we believe that it is more likely than not that the tax position will be sustained on examination by the taxing authorities based on the technical merits of the position. We recognize interest and penalties related to uncertain tax positions as a component of the provision for income taxes.\nAdvertising costs are expensed when incurred and are included in marketing and sales expenses on our consolidated statements of income.\nWe recognize one-time employee termination costs when notification occurs, based on the regional requirements in which the employee works.\nCash and cash equivalents consist of cash on deposit with financial institutions globally and highly liquid investments with maturities of 90 days or less from the date of purchase. We classify amounts in transit from customer credit cards and payment service providers as cash on our consolidated balance sheets. We hold investments in marketable securities, consisting of U.S. government securities, U.S. government agency securities, and investment grade corporate debt securities. We classify our marketable securities as available-for-sale (AFS) investments in our current assets because they represent investments of cash available for current operations."}}
{"id": "META-2023-12-31-item_8-chunk_13", "metadata": {"metatags": ["AFS investments", "Non-marketable equity"], "text": "Our AFS investments are carried at estimated fair value with any unrealized gains and losses, net of taxes, included in accumulated other comprehensive income (loss) in stockholders' equity. AFS debt securities with an amortized cost basis in excess of estimated fair value are assessed to determine what amount of that difference, if any, is caused by expected credit losses. Allowance for credit losses on AFS debt securities are recognized as a charge in interest and other income (expense), net on our consolidated statements of income, and any remaining unrealized losses, net of taxes, are included in accumulated other comprehensive income (loss) in stockholders' equity. The amounts of credit losses recorded for the years ended December 31, 2023, 2022, and 2021 were not material. We determine realized gains or losses on sale of marketable securities on a specific\nidentification method and include such gains or losses in interest and other income (expense), net on our consolidated statements of income. We classify certain restricted cash balances, consisting primarily of cash related to insurance policies, and retention and indemnification holdback for our acquisitions, within prepaid expenses and other current assets and other assets on our consolidated balance sheets based upon the expected duration of the restrictions.\n\nNon-marketable Equity Securities\nOur non-marketable equity securities are investments in privately-held companies without readily determinable fair values. We elected to account for substantially all of our non-marketable equity securities using the measurement alternative, which is cost, less any impairment, adjusted for changes in fair value resulting from observable transactions for identical or similar investments of the same issuer as of the respective transaction dates. We periodically review our non-marketable equity securities for impairment. When indicators exist and the estimated fair value of an investment is below the carrying amount, we write down the investment to fair value."}}
{"id": "META-2023-12-31-item_8-chunk_14", "metadata": {"metatags": ["Equity Securities", "Fair Value"], "text": "The change in carrying value, if any, gains and losses resulting from the remeasurements are recognized in interest and other income (expense), net on our consolidated statements of income. For additional information, see Note 6 - Non-marketable Equity Securities. In addition, we also held other non-marketable equity securities accounted for under the equity method which were immaterial as of December 31, 2023 and 2022.\nWe apply fair value accounting for all financial assets and liabilities and non-financial assets and liabilities that are recognized or disclosed at fair value in the financial statements on a recurring basis. We define fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities, which are required to be recorded at fair value, we consider the principal or most advantageous market in which we would transact and the market-based risk measurements or assumptions that market participants would use in pricing the asset or liability, such as risks inherent in valuation techniques, transfer restrictions and credit risk. Fair value is estimated by applying the following hierarchy, which prioritizes the inputs used to measure fair value into three levels and bases the categorization within the hierarchy upon the lowest level of input that is available and significant to the fair value measurement:\nLevel 1- Quoted prices in active markets for identical assets or liabilities.\nLevel 2- Observable inputs other than quoted prices in active markets for identical assets and liabilities, quoted prices for identical or similar assets or liabilities in inactive markets, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities."}}
{"id": "META-2023-12-31-item_8-chunk_15", "metadata": {"metatags": ["Fair Value", "Credit Losses"], "text": "Level 3- Inputs that are generally unobservable and typically reflect management's estimate of assumptions that market participants would use in pricing the asset or liability. Our cash equivalents and marketable debt securities are classified within Level 1 or Level 2 of the fair value hierarchy because their fair value is derived from quoted market prices or alternative pricing sources and models utilizing observable market inputs. Certain other assets are classified within Level 3 because factors used to develop the estimated fair value are unobservable inputs that are not supported by market activity. Our non-marketable equity securities accounted for using the measurement alternative are recorded at fair value on a non-recurring basis. When indicators of impairment exist or observable price changes of qualified transactions occur, the respective non-marketable equity security would be classified within Level 3 of the fair value hierarchy because the valuation methods include a combination of the observable transaction price at the transaction date and other unobservable inputs including volatility, rights, and obligations of the securities we hold.\nAccounts receivable are recorded and carried at the original invoiced amount less an allowance for any potential uncollectible amounts. We make estimates of expected credit and collectibility trends for the allowance for credit losses and\nallowance for unbilled receivables based upon our assessment of various factors, including historical experience, the age of the accounts receivable balances, credit quality of our customers, current economic conditions, reasonable and supportable forecasts of future economic conditions, and other factors that may affect our ability to collect from customers. Expected credit losses are recorded as general and administrative expenses on our consolidated statements of income. As of December 31, 2023 and 2022, the allowances for accounts receivable were immaterial."}}
{"id": "META-2023-12-31-item_8-chunk_16", "metadata": {"metatags": ["Depreciation methods", "Asset impairment"], "text": "Property and equipment, including finance leases, are depreciated and stated at cost less accumulated depreciation. Depreciation is computed using the straight-line method over the estimated useful lives of the assets or the remaining lease term, whichever is shorter. The estimated useful lives of property and equipment and amortization periods of finance lease right-of-use (ROU) assets are described below:\nWe evaluate at least annually the recoverability of property and equipment for possible impairment whenever events or circumstances indicate that the carrying amount of such assets may not be recoverable. If such review indicates that the carrying amount of property and equipment assets is not recoverable, and the asset's fair value is less than the carrying amount, an impairment charge is recognized. Additionally, we recorded abandonment charges and its related adjustments in 2023 and 2022 for data center construction in progress (CIP) assets under ASC Topic 360 related to our restructuring efforts. For additional information regarding our restructuring efforts, see Note 3 - Restructuring. The useful lives of our property and equipment are determined by management when those assets are initially recognized and are routinely reviewed for the remaining estimated useful lives. Our current estimate of useful lives represents the best estimate of the useful lives based on current facts and circumstances, but may differ from the actual useful lives due to changes to our business operations, changes in the planned use of assets, and technological advancements. When we change the estimated useful life assumption for any asset, the remaining carrying amount of the asset is accounted for prospectively and depreciated or amortized over the revised estimated useful life. Servers and network assets include property and equipment mostly in our data centers, which is used to support production traffic. Land and assets held within CIP are not depreciated."}}
{"id": "META-2023-12-31-item_8-chunk_17", "metadata": {"metatags": ["CIP accounting", "Lease accounting"], "text": "CIP is related to the construction or development of property and equipment that have not yet been placed in service for their intended use. We capitalize interest on our debt related to certain eligible CIP assets and depreciate over the useful life of the related assets. The cost of maintenance and repairs is expensed as incurred. When assets are retired or otherwise disposed of, the cost and related accumulated depreciation are removed from their respective accounts, and gain or loss on such sale or disposal is reflected in income from operations.\n\nOur operating leases mostly comprise of certain offices, data centers, and colocations. We also have finance leases for certain network infrastructure. We determine if an arrangement is a lease at inception. Most of our leases contain lease and non-lease components. Non-lease components include fixed payments for maintenance, utilities, real estate taxes, and management fees. We combine fixed lease and non-lease components and account for them as a single lease component. Our lease agreements may contain variable costs such as contingent rent escalations, common area maintenance, insurance, real estate taxes, or other costs. These amounts are affected by the Consumer Price Index, payments contingent on energy production for renewable energy purchase arrangements, and maintenance and utilities. Such variable lease costs are\nexpensed as incurred on our consolidated statements of income. For certain colocation and equipment leases, we apply a portfolio approach to effectively account for the operating lease ROU assets and lease liabilities. For leases with a lease term greater than 12 months, ROU assets and lease liabilities are recognized on our consolidated balance sheets at the commencement date based on the present value of the remaining fixed lease payments and includes only payments that are fixed and determinable at the time of commencement."}}
{"id": "META-2023-12-31-item_8-chunk_18", "metadata": {"metatags": ["Lease agreements", "Lease accounting"], "text": "Our lease terms may include options to extend or terminate the lease when it is reasonably certain that we will exercise such options. When determining the probability of exercising such options, we consider contract-based, asset-based, entity-based, and market-based factors. We do not assume renewals in our determination of the lease term unless the renewals are deemed to be reasonably assured. Our lease agreements generally do not contain any material residual value guarantees or material restrictive covenants. As most of our leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at the commencement date in determining the present value of lease payments. Our incremental borrowing rate is based on our understanding of what our credit rating would be in a similar economic environment. Operating leases are included in operating lease ROU assets, operating lease liabilities, current, and operating lease liabilities, non-current on our consolidated balance sheets. Finance leases are included in property and equipment, net, accrued expenses and other current liabilities, and other liabilities on our consolidated balance sheets. Operating lease costs are recognized on a straight-line basis over the lease terms. Finance lease assets are amortized on a straight-line basis over the shorter of the estimated useful lives of the assets or the lease terms."}}
{"id": "META-2023-12-31-item_8-chunk_19", "metadata": {"metatags": ["Fair Value", "Legal Proceedings"], "text": "The assumptions used in estimating fair value include the expected downtime prior to the commencement of future subleases, projected sublease income over the remaining lease periods, and discount rates that reflect the level of risk associated with receiving future cash flows. For additional information regarding our restructuring efforts, see Note 3 - Restructuring.\n\nWe are involved in legal proceedings, claims, and regulatory, tax or government inquiries and investigations that arise in the ordinary course of business. Certain of these matters include speculative claims for substantial or indeterminate amounts of damages. Additionally, we are required to comply with various legal and regulatory obligations around the world, and we regularly become subject to new laws and regulations in the jurisdictions in which we operate. The requirements for complying with these obligations may be uncertain and subject to interpretation and enforcement by regulatory and other authorities, and any failure to comply with such obligations could eventually lead to asserted legal or regulatory action. With respect to these matters, asserted and unasserted, we evaluate the associated developments on a regular basis and accrue a liability when we believe that it is both probable that a loss has been incurred and the amount can be reasonably estimated. If we determine there is a reasonable possibility that we may incur a loss and the loss or range of loss can be reasonably estimated, we record such losses as general and administrative expenses on our consolidated statements of income and disclose the possible loss in the accompanying notes to the consolidated financial statements to the extent material.\n\nWe allocate the fair value of purchase consideration to the tangible assets acquired, liabilities assumed and intangible assets acquired based on their estimated fair values as of the acquisition date."}}
{"id": "META-2023-12-31-item_8-chunk_20", "metadata": {"metatags": ["Goodwill Allocation", "Impairment Testing"], "text": "The excess of the fair value of purchase consideration over the fair values of these identifiable assets and liabilities is recorded as goodwill to reporting units based on the expected benefit from the business combination. Allocation of purchase consideration to identifiable assets and liabilities affects the amortization expense, as acquired finite-lived intangible assets are amortized over the useful life, whereas any indefinite-lived intangible assets, including goodwill, are not amortized. During the measurement period, which is not to exceed one year from the acquisition date, we record adjustments to the assets acquired and liabilities assumed, with the corresponding offset to goodwill. Upon the conclusion of the measurement period, any subsequent adjustments are recorded to earnings. Acquisition-related expenses are recognized separately from business combinations and are expensed as incurred.\nWe allocate goodwill to reporting units based on the expected benefit from business combinations. We evaluate our reporting units annually, as well as when changes in our operating segments occur. For changes in reporting units, we reassign goodwill using a relative fair value allocation approach. Goodwill is tested for impairment at the reporting unit level annually or more frequently if events or changes in circumstances would more likely than not reduce the fair value of a reporting unit below its carrying value. We have two reporting units subject to goodwill impairment testing. As of December 31, 2023, no impairment of goodwill has been identified. We evaluate the recoverability of finite-lived intangible assets for possible impairment whenever events or circumstances indicate that the carrying amount of such assets may not be recoverable. The evaluation of these intangible assets are performed at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities."}}
{"id": "META-2023-12-31-item_8-chunk_21", "metadata": {"metatags": ["Intangible Assets", "Foreign Currency"], "text": "Recoverability of these assets is measured by a comparison of the carrying amounts to the future undiscounted cash flows the assets are expected to generate from the use and eventual disposition. If such review indicates that the carrying amount of finite-lived intangible assets is not recoverable, and the assets fair value is less than the carrying amount, an impairment charge is recognized. We have not recorded any material impairment charges during the years presented. Our finite-lived intangible assets are amortized on a straight-line basis over the estimated useful lives of the assets. Indefinite-lived intangible assets are not amortized. If an indefinite-lived intangible asset is subsequently determined to have a finite useful life, the asset will be tested for impairment and accounted for as a finite-lived intangible asset prospectively over its estimated remaining useful life. We routinely review the remaining estimated useful lives of finite-lived intangible assets. If we change the estimated useful life assumption for any asset, the remaining unamortized balance is amortized over the revised estimated useful life.\nGenerally, the functional currency of our international subsidiaries is the local currency. We translate the financial statements of these subsidiaries to U.S. dollars using month-end rates of exchange for assets and liabilities, and average rates of exchange for revenue, costs, and expenses. Translation gains and losses are recorded in accumulated other comprehensive income (loss) as a component of stockholders' equity. Foreign currency transaction gains and losses from transactions denominated in a currency other than the functional currency of the subsidiary involved are recorded within interest and other income (expense), net on our consolidated statements of income."}}
{"id": "META-2023-12-31-item_8-chunk_22", "metadata": {"metatags": ["Credit Risk", "Cash Management"], "text": "Credit Risk and Concentration\nOur financial instruments that are potentially subject to concentrations of credit risk consist primarily of cash, cash equivalents, restricted cash, marketable securities, and accounts receivable. Cash equivalents consists mostly of money market funds, that primarily invest in U.S. government and agency securities. Marketable securities consist of investments in U.S. government securities, U.S. government agency securities, and investment grade corporate debt securities. As part of our cash management strategy, we concentrate cash deposits with large financial institutions and our marketable securities are held in diversified highly rated securities. Our investment portfolio in corporate debt securities is highly liquid and diversified among individual issuers. The amount of credit losses recorded for the year ended December 31, 2023 was not material. Accounts receivable are typically unsecured and are derived from revenue earned from customers across different industries and countries. We perform ongoing credit evaluations of our customers and generally do not require collateral. We maintain an allowance for estimated credit losses, and bad debt expense on these losses was not material during the years ended\nDecember 31, 2023, 2022, or 2021. In the event that accounts receivable collection cycles deteriorate, our operating results and financial position could be adversely affected."}}
{"id": "META-2023-12-31-item_8-chunk_23", "metadata": {"metatags": ["Major customers", "Accounting standards"], "text": "No customer represented 10% or more of total revenue during the years ended December 31, 2023, 2022, and 2021.\nRecently Adopted Accounting Pronouncements\nOn April 1, 2023 we early adopted Accounting Standards Update (ASU) No. 2023-01, Leases (Topic 842): Common Control Arrangements (ASU 2023-01), which requires leasehold improvements associated with common control leases to be amortized over the useful life to the common control group. The adoption of this new standard did not have a material impact on our consolidated financial statements.\nAccounting Pronouncements Not Yet Adopted\nIn November 2023, the Financial Accounting Standards Board (FASB) issued ASU No. 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures (ASU 2023-07), which requires an enhanced disclosure of significant segment expenses on an annual and interim basis. This guidance will be effective for the annual periods beginning the year ended December 31, 2024, and for interim periods beginning January 1, 2025. Early adoption is permitted. Upon adoption, the guidance should be applied retrospectively to all prior periods presented in the financial statements. We do not expect the adoption of this guidance to have a material impact on our consolidated financial statements.\nIn December 2023, the FASB issued ASU No. 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures (ASU 2023-09), which improves the transparency of income tax disclosures by requiring consistent categories and greater disaggregation of information in the effective tax rate reconciliation and income taxes paid disaggregated by jurisdiction. It also includes certain other amendments to improve the effectiveness of income tax disclosures. This guidance will be effective for the annual periods beginning the year ended December 31, 2025. Early adoption is permitted. Upon adoption, the guidance can be applied prospectively or retrospectively."}}
{"id": "META-2023-12-31-item_8-chunk_24", "metadata": {"metatags": ["Employee layoffs", "Severance costs"], "text": "We do not expect the adoption of this guidance to have a material impact on our consolidated financial statements. \nIn March 2023, we announced three rounds of planned layoffs to further reduce our company size by approximately 10,000 employees across the Family of Apps (FoA) and Reality Labs (RL) segments (the 2023 Restructuring). Impacted employees in our recruiting, technology, and business groups were notified during March 2023 to May 2023. As of December 31, 2023, we have completed these employee layoffs. In certain regions, a small portion of the impacted employees continue to be included in our reported headcount through 2024. We recognized $1.20 billion pre-tax severance and related personnel costs across the FoA and RL segments during the year ended December 31, 2023 in accordance with ASC Topic 420, Exit or Disposal Cost Obligations, where applicable."}}
{"id": "META-2023-12-31-item_8-chunk_25", "metadata": {"metatags": ["Restructuring initiatives", "Completed actions"], "text": "In 2022, we initiated several measures to pursue greater efficiency and to realign our business and strategic priorities. These measures included a facilities consolidation strategy to sublease, early terminate, or abandon several office buildings under operating leases, a layoff of approximately 11,000 employees across the FoA and RL segments, and a pivot towards a next generation data center design, including cancellation of multiple data center projects (the 2022 Restructuring). As of December 31, 2023, we have completed the data center initiatives and the 2022 employee layoffs, and substantially completed the facilities consolidation initiatives."}}
{"id": "META-2023-12-31-item_8-chunk_26", "metadata": {"metatags": ["Earnings per share", "Diluted EPS"], "text": "We compute earnings per share (EPS) of Class A and Class B common stock using the two-class method. As the liquidation and dividend rights for both Class A and Class B common stock are identical, the undistributed earnings are allocated on a proportionate basis to the weighted-average number of common shares outstanding for the period. Basic EPS is computed by dividing net income by the weighted-average number of shares of our Class A and Class B common stock outstanding. For the calculation of diluted EPS, net income for basic EPS is adjusted by the effect of dilutive securities, including restricted stock units (RSUs) awards under our Equity Incentive Plan. In addition, the computation of the diluted EPS of Class A common stock assumes the conversion of our Class B common stock to Class A common stock, while the diluted EPS of Class B common stock does not assume the conversion of those shares to Class A common stock. Diluted EPS is computed by dividing the resulting net income by the weighted-average number of fully diluted common shares outstanding. For the years ended December 31, 2023 and 2022, approximately 16 million and 95 million shares of Class A common stock equivalents of RSUs were excluded from the diluted EPS calculation, respectively, as including them would have an anti-dilutive effect. RSUs with anti-dilutive effect were not material for the year ended December 31, 2021. Basic and diluted EPS are the same for each class of common stock because they are entitled to the same liquidation and dividend rights."}}
{"id": "META-2023-12-31-item_8-chunk_27", "metadata": {"metatags": ["Fair Value", "Unrealized Losses"], "text": "Financial Instruments\nInstruments Measured at Fair Value\nWe classify our cash equivalents and marketable debt securities within Level 1 or Level 2 because we use quoted market prices or alternative pricing sources and models utilizing market observable inputs to determine their fair value. Certain other assets are classified within Level 3 because factors used to develop the estimated fair value are unobservable inputs that are not supported by market activity.\n\nUnrealized Losses\nThe decrease in the gross unrealized losses for the year ended December 31, 2023 is mostly due to a shorter average portfolio duration. The allowance for credit losses and the gross unrealized gains on our marketable debt securities were not material as of December 31, 2023 and 2022.\n\nInstruments Measured at Fair Value on Non-recurring Basis\nOur non-marketable equity securities accounted for using the measurement alternative are measured at fair value on a non-recurring basis and are classified within Level 3 of the fair value hierarchy because we use significant unobservable inputs to estimate their fair value. Assets remeasured at fair value on a non-recurring basis within Level 3 during the years ended December 31, 2023 and 2022 were $53 million and $198 million, respectively. For additional information, see Note 6 - Non-marketable Equity Securities. Note 6."}}
{"id": "META-2023-12-31-item_8-chunk_28", "metadata": {"metatags": ["Construction progress", "Operating leases"], "text": "Our non-marketable equity securities are investments in privately-held companies without readily determinable fair values.\n\nConstruction in progress includes costs mostly related to construction of data centers, network infrastructure and servers. As of December 31, 2023, and 2022, construction in progress also included $1.40 billion and $2.18 billion of servers and network assets components stored by our suppliers until required by our design manufacturers to fulfill certain purchase orders, respectively. During the year ended December 31, 2023, we capitalized $283 million of interest expense related to certain eligible construction in progress assets. During the years ended December 31, 2023, and 2022, we recorded $671 million and $508 million of impairment losses mostly for leasehold improvements assets as part of our facilities consolidation restructuring efforts, respectively. For additional information, see Note 3 - Restructuring.\n\nWe have entered into various non-cancelable operating lease agreements mostly for our offices, data centers, and colocations."}}
{"id": "META-2023-12-31-item_8-chunk_29", "metadata": {"metatags": ["Lease obligations", "Asset impairments"], "text": "We have also entered into various non-cancelable finance lease agreements for certain network infrastructure. Our leases have original lease periods expiring between 2024 and 2093. Many leases include one or more options to renew.\nWe also recorded $1.76 billion and $1.71 billion net impairment losses for operating lease right-of-use assets as a part of our facilities consolidation restructuring efforts for the years ended December 31, 2023, and 2022, respectively. For additional information, see Note 3 - Restructuring.\nAs of December 31, 2023, we have additional operating and finance leases, that have not yet commenced, with lease obligations of approximately $7.07 billion and $1.37 billion, respectively, mostly for data centers, colocations, and network infrastructure. These operating and finance leases will commence between 2024 and 2028 with lease terms of greater than one year to 30 years.\nDuring the year ended December 31, 2023, we completed business acquisitions with total purchase consideration of $467 million in cash, including $88 million and $352 million allocated to intangible assets and goodwill, respectively."}}
{"id": "META-2023-12-31-item_8-chunk_30", "metadata": {"metatags": ["Goodwill allocation", "Senior notes"], "text": "Goodwill generated from these business acquisitions was primarily attributable to expected synergies and potential monetization opportunities. The amount of goodwill generated that was deductible for tax purposes was not material. Acquisition-related costs were immaterial and were expensed as incurred. Pro forma historical results of operations related to these business acquisitions have not been presented because they are not significant to our consolidated financial statements, either individually or in aggregate. We have included the financial results of these acquired businesses in our consolidated financial statements from their respective dates of acquisition.\n\nAs of December 31, 2023, we had $18.50 billion of fixed-rate senior unsecured notes (the Notes), including $10.0 billion issued in August 2022 and $8.50 billion issued in May 2023.\n\nEach series of the Notes in the table above rank equally with each other. Interest on the Notes is payable semi-annually in arrears. We may redeem the Notes at any time, in whole or in part, at specified redemption prices. We are not subject to any financial covenants under the Notes."}}
{"id": "META-2023-12-31-item_8-chunk_31", "metadata": {"metatags": ["Contractual Commitments", "Renewable Energy"], "text": "We have $16.49 billion of non-cancelable contractual commitments as of December 31, 2023, which are primarily related to our investments in servers, network infrastructure, and consumer hardware products in Reality Labs. \n\nAdditionally, as part of the normal course of business, we have entered into multi-year agreements to purchase renewable energy that do not specify a fixed or minimum volume commitment or to purchase certain server components that do not specify a fixed or minimum price commitment. We enter into these agreements in order to secure either volume or price. Using the expected volume consumption, the total estimated spend related to our renewable energy agreements as of December 31, 2023 is approximately $15.12 billion, a majority of which is due beyond five years."}}
{"id": "META-2023-12-31-item_8-chunk_32", "metadata": {"metatags": ["Legal Proceedings", "Loss Estimates"], "text": "The ultimate spend under these agreements may vary and will be based on actual volume purchased.\nWith respect to the cases, actions, and inquiries described below, we evaluate the associated developments on a regular basis and accrue a liability when we believe a loss is probable and the amount can be reasonably estimated. In addition, we believe there is a reasonable possibility that we may incur a loss in some of these matters. With respect to the matters described below that do not include an estimate of the amount of loss or range of possible loss, such losses or range of possible losses either cannot be estimated or are not individually material, but we believe there is a reasonable possibility that they may be material in the aggregate. We are also party to various other legal proceedings, claims, and regulatory, tax or government inquiries and investigations that arise in the ordinary course of business. Additionally, we are required to comply with various legal and regulatory obligations around the world. The requirements for complying with these obligations may be uncertain and subject to interpretation and enforcement by regulatory and other authorities, and any failure to comply with such obligations could eventually lead to asserted legal or regulatory action. With respect to these other legal proceedings, claims, regulatory, tax, or government inquiries and investigations, and other matters, asserted and unasserted, we evaluate the associated developments on a regular basis and accrue a liability when we believe a loss is probable and the amount can be reasonably estimated. In addition, we believe there is a reasonable possibility that we may incur a loss in some of these other matters. We believe that the amount of losses or any estimable range of possible losses with respect to these other matters will not, either individually or in the aggregate, have a material adverse effect on our business and consolidated financial statements."}}
{"id": "META-2023-12-31-item_8-chunk_33", "metadata": {"metatags": ["Legal Matters", "Class Actions"], "text": "The ultimate outcome of the legal and related matters described in this section, such as whether the likelihood of loss is remote, reasonably possible, or probable, or if and when the reasonably possible range of loss is estimable, is inherently uncertain. Therefore, if one or more of these matters were resolved against us for amounts in excess of management's estimates of loss, our results of operations and financial condition, including in a particular reporting period in which any such outcome becomes probable and estimable, could be materially adversely affected. For information regarding income tax contingencies, see Note 15 - Income Taxes.\nBeginning on March 20, 2018, multiple putative class actions were filed in state and federal courts in the United States and elsewhere against us and certain of our directors and officers alleging various causes of action in connection with our platform and user data practices as well as the misuse of certain data by a developer that shared such data with third parties in violation of our terms and policies, and seeking unspecified damages and injunctive relief. With respect to the putative class actions alleging fraud and violations of consumer protection, privacy, and other laws in connection with the same matters, several of the cases brought on behalf of consumers in the United States were consolidated in the U.S. District Court for the Northern District of California (In re Facebook, Inc., Consumer Privacy User Profile Litigation). On September 9, 2019, the court granted, in part, and denied, in part, our motion to dismiss the consolidated putative consumer class action. On December 22, 2022, the parties entered into a settlement agreement to resolve the lawsuit, which provides for a payment of $725 million by us. The settlement was approved by the court on October 10, 2023, and the payment was made in November 2023."}}
{"id": "META-2023-12-31-item_8-chunk_34", "metadata": {"metatags": ["FTC settlement", "Stockholder litigation"], "text": "In addition, our platform and user data practices, as well as the events surrounding the misuse of certain data by a developer, became the subject of U.S. Federal Trade Commission (FTC), state attorneys general, and other government inquiries in the United States, Europe, and other jurisdictions. We entered into a settlement and modified consent order to resolve the FTC inquiry, which took effect in April 2020. Among other matters, our settlement with the FTC required us to pay a penalty of $5.0 billion which was paid in April 2020 upon the effectiveness of the modified consent order. The state attorneys general inquiry and certain government inquiries in other jurisdictions remain ongoing. On July 16, 2021, a stockholder derivative action was filed in Delaware Court of Chancery against certain of our directors and officers asserting breach of fiduciary duty and related claims relating to our historical platform and user data practices, as well as our settlement with the FTC. On July 20, 2021, other stockholders filed an amended derivative complaint in a related Delaware Chancery Court action, asserting breach of fiduciary duty and related claims against certain of our current and former directors and officers in connection with our historical platform and user data practices. On November 4, 2021, the lead plaintiffs filed a second amended and consolidated complaint in the stockholder derivative action. The pending consolidated matter is In re Facebook Inc. Derivative Litigation. On January 19, 2022, we filed a motion to dismiss, which was denied in part on May 10, 2023. The insider trading claim was dismissed as to all defendants except Mark Zuckerberg, and the motion was denied as to the breach of fiduciary duty claims. On May 3, 2023, the FTC filed a public administrative proceeding (In the Matter of Facebook, Inc.) seeking substantial changes to the modified consent order, which took effect in April 2020 after its entry by the U.S. District Court for the District of Columbia."}}
{"id": "META-2023-12-31-item_8-chunk_35", "metadata": {"metatags": ["FTC legal challenges", "consent order"], "text": "The changes sought by the FTC are set forth in a proposed order and include, among others, a prohibition on our use of minors' data for any commercial purposes, changes to the composition of our board of directors, and significant limitations on our ability to modify and launch new products. On May 31, 2023, we filed a motion before the U.S. District Court for the District of Columbia (USA v. Facebook, Inc.) seeking to enjoin the FTC from further pursuing its agency process to modify the modified consent order. On November 27, 2023, the district court denied our motion, and we have appealed to the U.S. Court of Appeals for the District of Columbia Circuit (U.S. v. Facebook, Inc.) and sought to stay the FTC proceeding pending resolution of the appeal. On January 12, 2024, the district court denied our motion for a stay pending appeal and, on January 25, 2024, we filed a motion for a stay pending appeal before the Court of Appeals. On November 29, 2023, we separately filed a complaint, also in the U.S. District Court for the District of Columbia (Meta Platforms, Inc. v. FTC), asserting constitutional challenges to the structure of the FTC, and seeking to preliminarily enjoin the FTC proceeding during the pendency of the litigation. On December 13, 2023, the FTC filed an opposition to our motion for preliminary injunction and a motion to dismiss the complaint. Oral argument on our motion to enjoin and the FTC’s motion to dismiss is scheduled for March 1, 2024. If the FTC proceeding is not enjoined or stayed, our response in the proceeding will be due on March 15, 2024, after which time the FTC could amend the order to impose these additional requirements set forth in the proposed order. We should have the opportunity to appeal an FTC decision modifying the order and could request the appellate court to stay the enforcement of the modifications to the order while the appeal is pending. It is unclear whether the appeal or the request for a stay would be successful."}}
{"id": "META-2023-12-31-item_8-chunk_36", "metadata": {"metatags": ["GDPR compliance", "Data protection"], "text": "We also notify the Irish Data Protection Commission (IDPC), our lead European Union privacy regulator under the General Data Protection Regulation (GDPR), of certain other personal data breaches and privacy issues, and are subject to inquiries and investigations by the IDPC and other European regulators regarding various aspects of our regulatory compliance. For example, on May 12, 2023, the IDPC issued a Final Decision concluding that Meta Platforms Ireland's reliance on Standard Contractual Clauses in respect of certain transfers of European Economic Area (EEA) Facebook user data was not in compliance with the GDPR. The IDPC issued an administrative fine of EUR €1.2 billion as well as corrective orders. The interpretation of the GDPR is still evolving, including through decisions of the Court of Justice of the European Union, and draft decisions in investigations by the IDPC are subject to review by other European privacy regulators as part of the GDPR's cooperation and consistency mechanisms, which may lead to significant changes in the final outcome of such investigations. As a result, the interpretation and enforcement of the GDPR, as well as the imposition and amount of penalties for non-compliance, are subject to significant uncertainty. Although we are vigorously defending our regulatory compliance, we have accrued significant amounts for loss contingencies related to these inquiries and investigations in Europe, and we believe there is a reasonable possibility that additional accruals for losses related to these matters could be material individually or in the aggregate. On February 14, 2022, the State of Texas filed a lawsuit against us in Texas state court (Texas v."}}
{"id": "META-2023-12-31-item_8-chunk_37", "metadata": {"metatags": ["Legal proceedings", "Antitrust issues"], "text": "Meta Platforms, Inc.) alleging that \"tag suggestions\" and other uses of facial recognition technology violated the Texas Capture or Use of Biometric Identifiers Act and the Texas Deceptive Trade Practices-Consumer Protection Act, and seeking statutory damages and injunctive relief. The case is currently scheduled for trial in June 2024. Beginning on June 7, 2021, multiple putative class actions were filed against us alleging that we improperly received individuals' information from third-party websites or apps via our business tools in violation of our terms and various state and federal laws and seeking unspecified damages and injunctive relief (for example, In re Meta Pixel Healthcare Litigation; In re Meta Pixel Tax Filing Cases; Frasco v. Flo Health, Inc.; Doe v. Hey Favor, Inc. et al.; Doe v. GoodRx Holdings, Inc. et al. in the U.S. District Court for the Northern District of California; and Rickwalder, et al. v. Meta Platforms, Inc. in the California Supreme Court).\nWe are subject to various litigation and government inquiries and investigations, formal or informal, by competition authorities in the United States, Europe, and other jurisdictions. Such investigations, inquiries, and lawsuits concern, among other things, our business practices in the areas of social networking or social media services, digital advertising, and/or mobile or online applications, as well as our acquisitions. For example, in 2019 we became the subject of antitrust investigations by the FTC, and U.S. Department of Justice. On December 9, 2020, the FTC filed a complaint (FTC v. Meta Platforms, Inc.) against us in the U.S. District Court for the District of Columbia alleging that we engaged in anticompetitive conduct and unfair methods of competition in violation of Section 5 of the Federal Trade Commission Act and Section 2 of the Sherman Act, including by acquiring Instagram in 2012 and WhatsApp in 2014 and by maintaining conditions on access to our platform."}}
{"id": "META-2023-12-31-item_8-chunk_38", "metadata": {"metatags": ["antitrust violations", "legal proceedings"], "text": "The FTC sought a permanent injunction against our company's alleged violations of the antitrust laws, and other equitable relief, including divestiture or reconstruction of Instagram and WhatsApp. On June 28, 2021, the court granted our motion to dismiss the complaint filed by the FTC with leave to amend. On August 19, 2021, the FTC filed an amended complaint, and on October 4, 2021, we filed a motion to dismiss this amended complaint. On January 11, 2022, the court denied our motion to dismiss the FTC's amended complaint. Multiple putative class actions have also been filed in state and federal courts in the United States and in the United Kingdom against us alleging violations of antitrust laws and other causes of action in connection with these acquisitions and/or other alleged anticompetitive conduct, and seeking damages and injunctive relief. Several of the cases brought on behalf of certain advertisers and users in the United States were consolidated in the U.S. District Court for the Northern District of California (Klein et al., v. Meta Platforms, Inc.). On January 14, 2022, the court granted, in part, and denied, in part, our motion to dismiss the consolidated actions. On March 1, 2022, a first amended consolidated complaint was filed in the putative class action brought on behalf of certain advertisers. On December 6, 2022, the court denied our motion to dismiss the first amended consolidated complaint filed in the putative class action brought on behalf of certain advertisers. In December 2022, the European Commission issued a Statement of Objections alleging that we tie Facebook Marketplace to Facebook and use data in a manner that infringes European Union competition rules."}}
{"id": "META-2023-12-31-item_8-chunk_39", "metadata": {"metatags": ["Securities litigation", "Government inquiries"], "text": "Securities and Other Actions\nBeginning on March 20, 2018, multiple putative class actions and derivative actions were filed in state and federal courts in the United States and elsewhere against us and certain of our directors and officers alleging violations of securities laws, breach of fiduciary duties, and other causes of action in connection with our platform and user data practices as well as the misuse of certain data by a developer that shared such data with third parties in violation of our terms and policies, and seeking unspecified damages and injunctive relief. Beginning on July 27, 2018, two putative class actions were filed in federal court in the United States against us and certain of our directors and officers alleging violations of securities laws in connection with the disclosure of our earnings results for the second quarter of 2018 and seeking unspecified damages. These two actions subsequently were transferred and consolidated in the U.S. District Court for the Northern District of California (In Re Facebook, Inc. Securities Litigation) with the putative securities class action described above relating to our platform and user data practices. In a series of orders in 2019 and 2020, the district court granted our motions to dismiss the plaintiffs' claims. On January 17, 2022, the plaintiffs filed a notice of appeal of the order dismissing their case, and on October 18, 2023, the U.S. Court of Appeals for the Ninth Circuit issued its decision affirming in part and reversing in part the district court's order dismissing the plaintiffs' case. We are also subject to other government inquiries and investigations relating to our business activities and disclosure practices."}}
{"id": "META-2023-12-31-item_8-chunk_40", "metadata": {"metatags": ["Legal proceedings", "Government investigations"], "text": "For example, beginning in September 2021, we became subject to government investigations and requests relating to a former employee's allegations and release of internal company documents concerning, among other things, our algorithms, advertising and user metrics, and content enforcement practices, as well as misinformation and other undesirable activity on our platform, and user well-being. We have since received additional requests relating to these and other topics. Beginning on October 27, 2021, multiple putative class actions and derivative actions were filed in the U.S. District Court for the Northern District of California against us and certain of our directors and officers alleging violations of securities laws, breach of fiduciary duties, and other causes of action in connection with the same matters, and seeking unspecified damages. On March 8, 2022, a putative class action was filed in the U.S. District Court for the Northern District of California against us and certain of our directors and officers alleging violations of securities laws in connection with the disclosure of our earnings results for the fourth quarter of 2021 and seeking unspecified damages. On July 18, 2023, the court dismissed the claims against Meta and its officers with leave to amend. On September 18, 2023, the plaintiffs filed an amended complaint. Youth-Related Actions\nBeginning in January 2022, we became subject to litigation and other proceedings that were filed in various federal and state courts alleging that Facebook and Instagram cause \"social media addiction\" in users, with most proceedings focused on those under 18 years old, resulting in various mental health and other harms."}}
{"id": "META-2023-12-31-item_8-chunk_41", "metadata": {"metatags": ["Social media litigation", "Advertising lawsuit"], "text": "Putative class actions have been filed in the United States and Canada on behalf of users in those jurisdictions, and numerous school districts, municipalities, and one state in the United States have filed public nuisance claims based on similar allegations. On October 6, 2022, the federal cases were centralized in the U.S. District Court for the Northern District of California (In re Social Media Adolescent\nAddiction Product Liability Personal Injury Litigation). On October 13, 2023, in In re Social Media Cases, the Los Angeles County Superior Court presiding over the California state court proceedings sustained in part and overruled in part our demurrer as to the plaintiff's claims. Beginning in October 2023, additional U.S. states have filed lawsuits on these topics in various federal and state courts. These additional lawsuits include allegations regarding violations of the Children's Online Privacy Protection Act (COPPA) as well as violations of state laws concerning consumer protection, unfair business practices, and products liability, with proceedings focused on our alleged business practices and harms to users under 18 years old. These lawsuits seek damages and injunctive relief, and include cases filed by various state attorneys general in In re Social Media Adolescent Addiction Product Liability Personal Injury Litigation in the U.S. District Court for the Northern District of California, as well as various state courts around the country. We are also subject to government investigations and requests from multiple regulators concerning the use of our products, and the alleged mental and physical health and safety impacts on users, particularly younger users. Other Actions\nBeginning on August 15, 2018, multiple putative class actions were filed against us alleging that we inflated our estimates of the potential audience size for advertisements, resulting in artificially increased demand and higher prices. The cases were consolidated in the U.S."}}
{"id": "META-2023-12-31-item_8-chunk_42", "metadata": {"metatags": ["Class action", "Legal proceedings"], "text": "In a series of rulings in 2019, 2021, and 2022, the court dismissed certain of the plaintiffs' claims, but permitted their fraud and unfair competition claims to proceed. On March 29, 2022, the court granted the plaintiffs' motion for class certification. On June 21, 2022, the U.S. Court of Appeals for the Ninth Circuit granted our petition for permission to appeal the district court's class certification order, and the court heard argument on September 12, 2023. The case is stayed in the district court pending appeal. Beginning on July 7, 2023, multiple putative class actions were filed against us in the U.S. District Court for the Northern District of California (Kadrey, et al. v. Meta Platforms, Inc. and Chabon, et al. v. Meta Platforms, Inc.) and U.S. District Court for the Southern District of New York (Huckabee, et al. v. Meta Platforms, Inc. et al.), which was subsequently transferred to the U.S. District Court for the Northern District of California) alleging that we used various copyrighted books and materials to train our artificial intelligence models, and seeking unspecified damages and injunctive relief. In addition, we are subject to litigation and other proceedings involving law enforcement and other regulatory agencies, including in particular in Brazil, Russia, and other countries in Europe, in order to ascertain the precise scope of our legal obligations to comply with the requests of those agencies, including our obligation to disclose user information in particular circumstances. A number of such instances have resulted in the assessment of fines and penalties against us. We believe we have multiple legal grounds to satisfy these requests or prevail against associated fines and penalties, and we intend to vigorously defend such fines and penalties."}}
{"id": "META-2023-12-31-item_8-chunk_43", "metadata": {"metatags": ["Indemnification agreements", "Common stock"], "text": "Indemnifications\nIn the normal course of business, to facilitate transactions of services and products, we have agreed to indemnify certain parties with respect to certain matters. We have agreed to hold certain parties harmless against losses arising from a breach of representations or covenants, or out of intellectual property infringement or other claims made by third parties. These agreements may limit the time within which an indemnification claim can be made and the amount of the claim. In addition, we have entered into indemnification agreements with our officers, directors, and certain employees, and our certificate of incorporation and bylaws contain similar indemnification obligations. It is not possible to determine the maximum potential amount under these indemnification agreements due to the limited history of prior indemnification claims and the unique facts and circumstances involved in each particular agreement. Historically, payments made by us under these agreements have not had a material impact on our consolidated financial statements. In our opinion, as of December 31, 2023, there was not a reasonable possibility we had incurred a material loss with respect to indemnification of such parties. We have not recorded any liability for costs related to indemnification through December 31, 2023. \nNote 13. Stockholders' Equity\nCommon Stock\nOur certificate of incorporation authorizes the issuance of Class A common stock and Class B common stock. As of December 31, 2023, we are authorized to issue 5,000 million shares of Class A common stock and 4,141 million shares of Class B common stock, each with a par value of $0.000006 per share. Holders of our Class A common stock and Class B common stock are entitled to dividends when, as, and if declared by our board of directors, subject to the rights of the holders of all classes of stock outstanding having priority rights to dividends."}}
{"id": "META-2023-12-31-item_8-chunk_44", "metadata": {"metatags": ["Stock Classes", "Share Repurchase"], "text": "The holder of each share of Class A common stock is entitled to one vote, while the holder of each share of Class B common stock is entitled to ten votes. Shares of our Class B common stock are convertible into an equivalent number of shares of our Class A common stock and generally convert into shares of our Class A common stock upon transfer. Class A common stock and Class B common stock are collectively referred to as common stock throughout the notes to these financial statements, unless otherwise noted. As of December 31, 2023, there were 2,211 million shares of Class A common stock and 350 million shares of Class B common stock issued and outstanding.\nCapital Return Program\nShare Repurchase\nOur board of directors has authorized a share repurchase program of our Class A common stock, which commenced in January 2017 and does not have an expiration date. As of December 31, 2022, $10.87 billion remained available and authorized for repurchases under this program. In January 2023, an additional $40 billion of repurchases was authorized under this program. In 2023, we repurchased and subsequently retired 92 million shares of our Class A common stock for an aggregate amount of $20.03 billion, which includes the 1% excise tax accruals as a result of the Inflation Reduction Act of 2022. As of December 31, 2023, $30.93 billion remained available and authorized for repurchases. In January 2024, an additional $50 billion of repurchases was authorized under this program. The timing and actual number of shares repurchased under the repurchase program depend on a variety of factors, including price, general business and market conditions, and other investment opportunities. Shares may be repurchased through open market purchases or privately negotiated transactions, including through the use of trading plans intended to qualify under Rule 10b5-1 under the Securities Exchange Act of 1934, as amended.\nDividend\nOn February 1, 2024, we announced the initiation of our first ever cash dividend program."}}
{"id": "META-2023-12-31-item_8-chunk_45", "metadata": {"metatags": ["Cash Dividends", "Equity Incentive Plan"], "text": "This cash dividend of $0.50 per share of common stock is equivalent to $2.00 per share on an annual basis. The first cash dividend will be paid on March 26, 2024 to all holders of record of common stock at the close of business on February 22, 2024. Subject to legally available funds and future declaration by our board of directors, we currently intend to continue to pay a quarterly cash dividend on our outstanding common stock. The declaration and payment of future dividends is at the sole discretion of our board of directors after taking into account various factors, including our financial condition, operating results, available cash, and current and anticipated cash needs.\nShare-based Compensation Plan\nWe have one active share-based employee compensation plan, the 2012 Equity Incentive Plan (Amended 2012 Plan), which was amended in each of June 2016, February 2018, and December 2022. Our Amended 2012 Plan provides for the issuance of incentive and nonqualified stock options, restricted stock awards, stock appreciation rights, RSUs, performance shares, and stock bonuses to qualified employees, directors, and consultants. Shares that are withheld in connection with the net settlement of RSUs or forfeited are added to the reserves of the Amended 2012 Plan. On March 1, 2023, the number of shares available for issuance under the Amended 2012 Plan increased by 425 million shares pursuant to the December 2022 amendment. As of December 31, 2023, there were 494 million shares of our Class A common stock reserved for future issuance under our Amended 2012 Plan."}}
{"id": "META-2023-12-31-item_8-chunk_46", "metadata": {"metatags": ["RSU vesting", "tax attributes"], "text": "The fair value as of the respective vesting dates of RSUs that vested during the years ended December 31, 2023, 2022, and 2021 was $17.46 billion, $9.44 billion, and $14.42 billion, respectively. The income tax benefit recognized related to awards vested during the years ended December 31, 2023, 2022, and 2021 was $3.65 billion, $2.00 billion, and $3.08 billion, respectively. As of December 31, 2023, there was $29.46 billion of unrecognized share-based compensation expense related to RSU awards. This unrecognized compensation expense is expected to be recognized over a weighted-average period of approximately three years based on vesting under the award service conditions.\nThe valuation allowance was approximately $2.88 billion and $2.49 billion as of December 31, 2023 and 2022, respectively, primarily related to U.S. state tax credit carryforwards, U.S. foreign tax credits, unrealized losses in marketable securities, and certain foreign tax attributes for which we do not believe a tax benefit is more likely than not to be realized. As of December 31, 2023, the U.S. federal and state net operating loss carryforwards were $200 million and $2.78 billion, which will begin to expire in 2035 and 2031, respectively, if not utilized. We have federal tax credit carryforwards of $490 million, which will begin to expire in 2029, if not utilized, and state tax credit carryforwards of $4.08 billion, most of which do not expire."}}
{"id": "META-2023-12-31-item_8-chunk_47", "metadata": {"metatags": ["Tax loss carryforwards", "Tax examinations"], "text": "Utilization of our net operating loss and tax credit carryforwards may be subject to substantial annual limitations due to the ownership change limitations provided by the Internal Revenue Code and similar state provisions. Such annual limitations could result in the expiration of the net operating loss and tax credit carryforwards before their utilization. The events that may cause ownership changes include, but are not limited to, a cumulative stock ownership change of greater than 50% over a three-year period.\nThese unrecognized tax benefits were primarily accrued for the uncertainties related to transfer pricing with our foreign subsidiaries, which include licensing of intellectual property, providing services and other transactions, as well as for the uncertainties with our research tax credits. During all years presented, we recognized interest and penalties related to unrecognized tax benefits within the provision for income taxes on our consolidated statements of income. We are subject to taxation in the United States and various other state and foreign jurisdictions. The material jurisdictions in which we are subject to potential examination include the United States and Ireland. We are under examination by the Internal Revenue Service (IRS) for our 2017 through 2019 tax years. Our 2014 through 2016 tax years are with the IRS Independent Office of Appeals for certain unresolved issues. Our 2020 and subsequent tax years remain open to examination by the IRS and the Irish Revenue Commissioners."}}
{"id": "META-2023-12-31-item_8-chunk_48", "metadata": {"metatags": ["IRS tax dispute", "transfer pricing"], "text": "In July 2016, we received a Statutory Notice of Deficiency (Notice) from the IRS related to transfer pricing with our foreign subsidiaries in conjunction with the examination of the 2010 tax year. While the Notice applies only to the 2010 tax year, the IRS stated that it will also apply its position for tax years subsequent to 2010 and has done so in years covered by the second Notice described below. We do not agree with the position of the IRS and have filed a petition in the Tax Court challenging the Notice. On January 15, 2020, the IRS's amendment to answer was filed stating that it planned to assert at trial an adjustment that is higher than the adjustment stated in the Notice. The first session of the trial was completed in March 2020 and the final trial session was completed in August 2022. We expect the Tax Court to issue an opinion in 2024. Based on the information provided, we believe that, if the IRS prevails in its updated position, this could result in an additional federal tax liability of an estimated, aggregate amount of up to approximately $9.0 billion in excess of the amounts in our originally filed U.S. return, plus interest and any penalties asserted. In March 2018, we received a second Notice from the IRS in conjunction with the examination of our 2011 through 2013 tax years. The IRS applied its position from the 2010 tax year to each of these years and also proposed new adjustments related to other transfer pricing with our foreign subsidiaries and certain tax credits that we claimed. If the IRS prevails in its position for these new adjustments, this could result in an additional federal tax liability of up to approximately $680 million in excess of the amounts in our originally filed U.S. returns, plus interest and any penalties asserted. We do not agree with the positions of the IRS in the second Notice and have filed a petition in the Tax Court challenging the second Notice."}}
{"id": "META-2023-12-31-item_8-chunk_49", "metadata": {"metatags": ["Unrecognized tax benefits", "Segment reporting"], "text": "We have previously accrued an estimated unrecognized tax benefit consistent with the guidance in ASC 740, Income Taxes (ASC 740), that is lower than the potential additional federal tax liability from the positions taken by the IRS in the two Notices and its Pretrial Memorandum. In addition, if the IRS prevails in its positions related to transfer pricing with our foreign subsidiaries, the additional tax that we would owe would be partially offset by a reduction in the tax that we owe under the mandatory transition tax on accumulated foreign earnings from the 2017 Tax Cuts and Jobs Act. As of December 31, 2023, we have not resolved these matters and proceedings continue in the Tax Court. We believe that adequate amounts have been reserved in accordance with ASC 740 for any adjustments to the provision for income taxes or other tax items that may ultimately result from these examinations. The timing of the resolution, settlement, and closure of any audits is highly uncertain, and it is reasonably possible that the balance of gross unrecognized tax benefits could significantly change in the next 12 months. Given the number of years remaining that are subject to examination, we are unable to estimate the full range of possible adjustments to the balance of gross unrecognized tax benefits. If the tax authorities prevail in the assessment of additional tax due, the assessed tax, interest, and penalties, if any, could have a material adverse impact on our financial position, results of operations, and cash flows. \nWe report our financial results for our two reportable segments: Family of Apps (FoA) and Reality Labs (RL). FoA includes Facebook, Instagram, Messenger, WhatsApp, and other services. RL includes our augmented, mixed and virtual reality related consumer hardware, software, and content. Our operating segments are the same as our reportable segments."}}
{"id": "META-2023-12-31-item_8-chunk_50", "metadata": {"metatags": ["Segment performance", "Cost allocation"], "text": "Our chief executive officer is our chief operating decision maker (CODM), who allocates resources to and assesses the performance of each operating segment using information about the operating segment's revenue and income (loss) from operations. Our CODM does not evaluate operating segments using asset or liability information. Revenue and costs and expenses are generally directly attributed to our segments. These costs and expenses include certain product development related operating expenses, costs associated with partnership arrangements, consumer hardware product costs, content costs, legal-related costs, and severance costs. Indirect costs are allocated to segments based on a reasonable allocation methodology, when such costs are significant to the performance measures of the operating segments. Indirect cost of revenue is allocated to our segments based on usage, such as costs related to the operation of our data centers and technical infrastructure. Indirect operating expenses, such as facilities, information technology, certain shared research and development activities, recruiting, physical security expenses, and certain restructuring costs, are mostly allocated based on headcount.\n\nFor information regarding revenue disaggregated by geography, see Note 2 - Revenue."}}
{"id": "META-2023-12-31-item_9A-chunk_0", "metadata": {"metatags": ["Disclosure controls", "Internal control"], "text": "Our management, with the participation of our chief executive officer (CEO) and chief financial officer (CFO), has evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a- 15(e) and 15d- 15(e) under the Securities Exchange Act of 1934, as amended (Exchange Act)), as of the end of the period covered by this Annual Report on Form 10-K. Based on such evaluation, our CEO and CFO have concluded that as of December 31, 2023, our disclosure controls and procedures are designed at a reasonable assurance level and are effective to provide reasonable assurance that information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the Securities and Exchange Commission, and that such information is accumulated and communicated to our management, including our CEO and CFO, as appropriate, to allow timely decisions regarding required disclosure.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Management conducted an assessment of the effectiveness of our internal control over financial reporting based on the criteria set forth in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework). Based on the assessment, management has concluded that its internal control over financial reporting was effective as of December 31, 2023 to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with U.S. GAAP."}}
{"id": "META-2023-12-31-item_9A-chunk_1", "metadata": {"metatags": ["Internal control", "Control limitations"], "text": "Changes in Internal Control\nThere were no changes in our internal control over financial reporting identified in management's evaluation pursuant to Rules 13a-15(d) or 15d-15(d) of the Exchange Act during the fourth quarter of 2023 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Limitations on Effectiveness of Controls and Procedures and Internal Control over Financial Reporting\nIn designing and evaluating the disclosure controls and procedures and internal control over financial reporting, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. In addition, the design of disclosure controls and procedures and internal control over financial reporting must reflect the fact that there are resource constraints and that management is required to apply judgment in evaluating the benefits of possible controls and procedures relative to their costs."}}
{"id": "META-2023-12-31-item_9B-chunk_0", "metadata": {"metatags": ["10b5-1 trading plan", "executive stock sale"], "text": "On November 30, 2023, Jennifer Newstead, our Chief Legal Officer, entered into a trading plan intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Securities Exchange Act of 1934, as amended. The trading plan provides for the sale of an aggregate of 10,968 shares of our Class A common stock and all shares received during the duration of the plan pursuant to Ms. Newstead's outstanding equity awards and any future equity award grants, excluding any shares withheld by the company to satisfy its income tax withholding and remittance obligations in connection with the net settlement of the equity awards. The plan will terminate on May 13, 2025, subject to early termination for certain specified events set forth in the plan."}}
